#version: 0.2
0 0
Ġ '
' :
00 00
o n
0000 0000
c t
c e
a l
i on
ct ion
u n
f un
Ġ ;
fun ction
Ġ' ,
e r
r e
r a
s s
i n
t ra
d d
a s
v i
e w
Ġ 1
vi ew
Ġ view
' ,
re ss
dd ress
a ddress
) ':
b l
00000000 00000000
r i
{ '
2 5
Ġ 0
i s
g as
[ {'
} ]
č Ċ
d e
p a
in t
on ce
n once
t y
n s
u int
tra ns
25 6
c k
a n
al l
Ġ 2
c h
Ġ pa
an ce
bl e
a ble
P ri
Ġpa y
Ġpay able
p l
Ġ 3
u s
u e
m b
( )
( )':
al ance
on e
N one
b alance
v al
o ck
e e
I n
s e
p e
Pri ce
de x
In dex
c on
a in
tra ct
mb er
u mber
N umber
a ction
bl ock
I d
val ue
trans action
g o
gas Price
ty pe
block Number
ch ain
transaction Index
chain Id
con tract
pl us
go plus
r o
c all
F ee
m a
ma x
Ġ F
al se
ĠF alse
0000000000000000 0000000000000000
P er
ri ty
G as
Fee Per
FeePer Gas
Ġ call
00 0
f er
t o
00000000 0
Ġ 4
trans fer
tra ce
t e
Ġ 5
a c
o w
ro m
Ġcall trace
is t
a ck
7 1
9 9
L ist
2 8
6 1
] ,
6 5
n er
0 1
7 5
6 8
6 4
7 4
2 1
3 8
2 4
0 5
P a
9 4
7 8
9 5
[ ],
ac ce
9 1
Ġ to
6 3
0 4
7 3
o rity
9 8
y Pa
acce ss
yPa rity
access List
max Pri
max FeePerGas
ority FeePerGas
maxPri orityFeePerGas
Ġ [],
0 8
2 3
0 3
' }]
Ġ _
t ch
u p
f f
b ack
d is
all back
tch er
dis pa
dispa tcher
9 3
f allback
v e
Ġ2 1
00000000 00
Ġ transfer
p ro
00000000 0000
te s
ow ance
i m
p pro
0 2
de c
Ġ3 8
y tes
b ytes
Ġ 8
Ġ1 5
O w
Ow ner
1 8
o l
Ġ3 7
1 5
e d
7 2
6 6
1 4
O f
t al
F rom
m e
3 5
0 6
f rom
- -
g e
3 4
pl y
S up
ppro ve
Sup ply
7 6
balance Of
tal Supply
00000000000000000000000000000000 0000000000000000
3 2
9 2
Ġ1 4
Ġ p
h i
a pprove
1 1
c a
c o
9 6
Ġ 6
Ġp u
l l
7 7
as e
Owner s
hi p
a me
Owners hip
Ġpu re
k e
5 4
3 3
T o
n ame
Ġ21 000
y mb
ymb ol
s ymbol
al s
dec im
decim als
Ġ1 8
5 8
Ġ' _
9 7
all owance
2 2
ase A
Ġ T
re aseA
co de
0 7
ĠT r
" {'
" }]
} "}]
Ġ "{'
Ġ' }"}]
ĠTr ue
Ġ"{' _
Ġ1 1
4 4
2 6
ow ner
8 8
3 1
0 9
a f
4 5
000000000000000000000000000000000000000000000000 000000000000
Ġ 9
se t
B l
a d
3 6
4 8
2 7
t h
x b
x f
a b
ge t
2 0
5 5
Ġ balanceOf
Bl ack
g ra
Ġ 7
x d
to talSupply
1 6
n d
ll owance
reaseA llowance
Ġ 25
Ġ1 3
9 0
x e
To ke
us e
s t
a a
gra de
b u
Ġ approve
Ġ2 8
Ġ --
Ġ2 000000000
Ġtransfer From
2 9
4 1
6 7
n t
o r
8 5
d b
c b
a te
00000000000000000000000000000000 00000000000000000000000000000000
Ġto talSupply
7 0
in g
f a
ff ff
1 3
f b
8 4
Ġ1 2
6 2
transfer From
Ġ None
Ġ name
e b
Ġ symbol
r n
Ġ decimals
f c
Ġ2 0
7 9
o un
Ġ allowance
m in
Ġ re
x c
0000 0
up grade
a t
in c
1 2
bu rn
m int
d c
4 3
4 6
Ġ1 6
e c
5 3
8 1
e f
pa use
5 6
5 1
Ġ owner
call trace
3 0
Ġ2 7
b b
Black List
d a
e a
8 2
3 9
Ġ set
3 7
5 0
x a
te d
Ġ get
5 7
Ġ -
Ġ de
5 2
1 7
c f
Ġ9 0000
4 7
Ġ1 7
T ra
an ge
f d
ch ange
c c
4 2
71 28
Ġ2 0000000000
us ed
f e
8 0
8 6
Ġ' }]
ppro val
Ġ e
000000000000000000000000000000000000000000000000000000000000 00
4 9
Ġtransfer Ownership
transfer Ownership
Ġ20 7128
Ġ15 00000000
dec reaseAllowance
inc reaseAllowance
i th
Ġ1 0
6 9
0000000000000000 00000000
1 0
d ra
Toke n
l e
1 9
n oun
ce Ownership
noun ceOwnership
6 0
8 3
0000 000
Tra ns
000000000000000000000000000000000000000000000000000000000000 000
A ddress
b a
b c
5 9
00000000 000
Toke ns
d f
4 0
8 7
Trans fer
dra w
Ġ s
un pause
ith draw
p re
i t
C all
ke n
b f
upgrade To
o ol
pre ca
a dd
reaseA pproval
A nd
w ithdraw
er s
Ġ1 000000000
b ool
th er
Ġ se
m o
at ion
un d
a r
And Call
M int
mo ve
A d
Ġ1 9
Ġ1 02
8 9
b d
ffff ffff
F und
Ġse nd
Ġ2 2
000000000000 000
Ġ mint
Ad min
0000 00
Ġ2 4
Ġ burn
Ġ1 00000000
Ġ3 5
a e
Ġe ther
S t
af e
A ll
me nt
c d
I N
Ġ is
b e
u m
de e
Ġ2 3
000000000000 00
pl e
M A
r ing
Fund s
to r
R e
Ġ4 2
im um
F or
t ion
ro y
ad min
st roy
Ġ c
Ġ25 0000
st ring
Ġ-- --
Ġ4 5
Ġ 65
ple ment
Ġ102 000000000
balance s
plement ation
Ġ 99
R ate
MA X
Ġ 94
ow ed
Ġ 63
000000000000 0
Ġ1 05
l a
Ġ2 6
Ġ 61
Ġ 75
Ġ increaseAllowance
Ġ decreaseAllowance
Ġpa used
pa used
im plementation
Ġ3 1
ss ue
Ġ5 0000
Ġ 64
Ġ change
5 05
Ġ3 4
t er
p o
ers ion
all owed
Ġ 74
is ted
re nounceOwnership
Ġre nounceOwnership
Ġ3 3
ee ee
Ġ4 8
i ssue
99 5
Ġ1 00
is h
64 4
IN T
Ġ 71
Ġ5 5
Pa ra
Ġ1 18
im e
u l
Ġpa use
in ish
Ġ 73
dee m
Ġ5 1
Ġ4 1
z e
Ġ 68
Ġ3 2
r d
Ġ unpause
Ġ3 6
v ersion
at us
Ġ-- -
to ken
Ġ 78
St atus
7 91
Ġ withdraw
Ġto ken
C on
Ġ 95
po s
P o
Ġ upgradeTo
L isted
75 1
max imum
d Address
m s
U INT
9 38
Para ms
preca ted
Po int
Ġ1 15
preca te
Black Listed
as is
asis Point
add BlackList
move BlackList
Black Funds
BlackList Status
Ġ4 4
asisPoint s
maximum Fee
stroy BlackFunds
b asisPoints
basisPoints Rate
upgrade dAddress
Ġ f
inc reaseApproval
dec reaseApproval
Ġ1 01
Ġ1 21
Ġ1 00000
5 15
Ġ1 04
ge nt
e t
oun t
ct or
Ġ1 24
Ġ4 6
7 95
61 5
a p
7 00
9 08
Mint er
pos it
U p
Ġ4 3
Ġ1 08
A c
Ġ2 9
Ġ5 0000000000
0000000000000000 0
98 4
A pprove
al e
Ġ1 35
R I
_ (
Ġ5 4
Ġ1 28
75 6
00 1
24 8
4 94
Ġ 91
Ġ5 3
Up grade
Ġ1 25
le g
3 05
Ġ1 14
Ġ 66
Ġ1 34
al i
Ġ5 8
Ġ1 38
Ġ1 03
Ġ3 9
nonce s
T ime
71 9
co un
Transfer From
For All
P ro
coun t
Ġ1 23
71 4
ctor y
Ġ 98
Ġ1 94
0000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000
9 01
M a
7 74
Ġ5 2
Ġ 93
25 9
Ġ3 0
73 9
Ġ5 00000
Approve d
Ġ 72
Ġ1 65
74 5
Ġ21 000000000
ffffffff ffffffff
la im
afe TransferFrom
000000000000000000000000000000000000000000000000000000000000000 1
Ġ1 11
Ġ3 000000000
ar t
l ock
01 5
A gent
97 9
Ġ1 74
94 7
Ġ1 68
Ġ8 4
Ġ4 9
Ġ5 6
00 4
28 8
25 8
3 65
Ġ4 7
9 68
p t
Ġ1 61
Ac count
00 2
t s
E T
99 99
78 2
fa ctory
Ġ1 93
O rd
[ ]
21 8
9 65
Ġ 77
U RI
de d
e n
3 24
Ġ1 95
ET H
2 23
Ġ5 0
Ġ admin
2 06
a tor
Ġ4 0
o ca
Ġ8 8
21 7
61 6
75 5
Ġ3 0000000000
Ġ1 64
Ġ6 2
Ġ 76
91 3
7 64
p or
21 4
0 24
01 8
68 1
00 8
Ġs w
Ġ1 78
f dd
v er
p er
Ġ1 71
Ġ balances
Ġ1 0000000000
14 8
acce pt
ul t
Ġ8 1
9 05
All oca
In ter
000000000000000000000000000000000000000000000000 00000000
Ġ2 00000
E R
Ġ1 91
Ġ MAX
Ġ1 22
21 0
Ġ implementation
Ġ5 7
73 3
fa ce
71 8
4 61
Bl ock
ar d
Ġ 92
Ġ1 75
x ad
Inter face
2 05
A L
Ġ6 0000
00 5
74 6
up por
24 4
95 8
uppor ts
71 1
upports Interface
Ġ1 63
Ġ1 33
A u
accept Ownership
74 8
vi s
65 9
98 3
Ġ8 5
Ġ 96
Ġ allowed
m ount
Ġget Owner
get Owner
38 9
3 14
0 28
ce c
0 63
Ġ issue
04 8
F inish
c ol
3 644
Ġ1 31
Finish ed
25 1
d ate
25 4
T I
per ator
ro ll
Ġ a
ve s
Ġ5 9
08 8
78 4
6 000
change Admin
Ġchange Admin
0 38
ff f
Ord er
00 3
75 8
99 8
68 5
24 9
61 8
ri bu
78 8
l ist
71 3
25 5
73 4
61 1
75 4
28 4
b db
21 5
63 5
Ġre deem
Ġ6 7
68 8
68 4
98 5
Ġ1 36
65 5
i g
Ġ1 32
65 6
01 6
61 4
re deem
03 1
63 3
P L
23 4
73 1
99 7
S U
64 8
roll er
xd c
71 2
xf b
97 0
28 5
ad f
25 2
Ġ6 9
65 8
38 8
24 5
i l
01 1
63 4
98 8
99 1
04 5
SU P
PL Y
SUP PLY
Ġ1 06
03 9
78 5
94 4
x ca
ing Finished
01 4
04 4
Mint ing
d ing
Ġ1 26
03 5
72 6
x af
21 1
03 3
73 5
45 9
65 4
eeee eeee
71 5
B alance
Ġ11 6
hi te
de precated
Ġde precated
de precate
Ġde precate
Ġis BlackListed
is BlackListed
96 2
set Params
Ġset Params
64 5
Ġ addBlackList
re moveBlackList
Ġre moveBlackList
get BlackListStatus
Ġget BlackListStatus
Ġ maximumFee
de stroyBlackFunds
03 4
Ġde stroyBlackFunds
Ġ6 0
Ġ basisPointsRate
Ġ upgradedAddress
99 4
78 1
Ġ increaseApproval
Ġ decreaseApproval
leg ate
23 1
re ate
01 0
74 2
to col
t roller
ke ns
u r
tocol Fee
upgradeTo AndCall
ĠupgradeTo AndCall
25 3
re nt
ac cf
99 3
21 6
38 6
23 5
66 6
94 8
38 4
Ġ14 1
96 9
ee p
28 2
91 8
08 2
xf a
Ġ8 3
74 4
0000000000000000 00
04 6
05 8
02 2
93 4
98 6
04 1
03 6
val i
Ġ1 27
W ETH
A mount
65 1
21 95
98 1
Ġ st
inish Minting
24 1
91 5
64 1
23 3
00 6
Ġ8 2
Ġ8 6
B y
95 1
91 4
92 6
95 4
a m
0000000000000000 000000000
to tal
A t
Ġ version
Ġ 97
28 1
76 2
08 4
08 1
63 2
93 5
73 6
D e
74 1
Ġ4 0000000000
95 5
08 5
0 94
i ll
38 1
25 7
99 6
Ġ11 3
02 75
63 6
A pproval
91 1
Ġto tal
63 9
Ġ8 9
24 7
63 1
08 3
Ġ14 4
66 2
0 68
72 2
s er
05 4
00000000000000000000000000000000000000000000000000000000000000 1
21 3
99 2
Ġ1 07
72 7
38 0
93 1
18 2
38 5
Ġburn From
Ġ11 7
Ġ1 73
71 6
34 6
78 6
burn From
tes t
Alloca tion
o d
n able
Ġ14 5
05 1
Ġ4 000000000
i r
64 3
65 3
23 6
38 2
Ġ14 8
Ġ add
61 3
Ġde posit
78 3
25 0
75 3
all et
i gra
O N
91 2
01 2
94 5
64 2
re e
93 3
Approval ForAll
04 3
02 6
68 2
21 2
Ġ7 9
18 3
88 03
Ġ11 2
91 6
Ġ1 66
05 5
to p
24 2
61 2
or d
S ale
72 9
Ġ nonces
68 6
35 7
Ġ8 7
in ali
64 6
61 7
Ġ15 8
c da
28 3
938 2
5 20
74 3
94 1
i c
Ġ5 000000000
1 739
04 2
73 2
i ve
v a
x ac
24 3
db ee
E N
76 7
ab e
75 2
Ġ---- --
63 7
Ġ18 8
2 751
95 2
38 3
03 2
58 5
23 2
ab de
x ded
75 9
xb aa
O perator
Pro tocolFee
33 700
cb afe
2 979
28 6
28 0
fb f
M in
24 6
35 3
5 984
Ġ15 5
Ġ15 0000
65 7
Ġ1 09
as ter
91 7
2195 995
00 7
23 7
98 7
Ġs afeTransferFrom
61 0
i od
M aster
93 6
77 7
e ad
Ġ in
Approved ForAll
75 7
26 2
01 3
93 0
Per iod
21 9
C ount
14 5
c laim
ult i
63 0
68 3
s ale
65 2
x y
98 0
28 7
o t
93 2
Ġ14 3
64 7
Ġ7 0
d af
04 7
08 6
92 7
0000 01
Ġ1 67
Ġ11 9
94 6
93 7
W hite
pe nd
Ġ1 29
da tor
Ġ15 3
us h
Ġ14 6
z ed
02 7
76 0
02 0
Ġsw ap
74 7
le ase
F allback
Ġ6 0000000000
71 7
Ġ15 1
re ation
66 7
Ġ o
92 2
By Index
18 9
16 0
99 9
96 7
03 7
xd f
01 7
76 9
ree ze
73 7
06 2
s afeTransferFrom
95 6
Con tract
95 7
Ġ1 72
38 7
L ock
23 9
98 2
0000000000000000000000000000000000000000000000000000000000000000 000000000000000000000000000000000000000000000000
94 3
34 8
va il
vail able
Ġ1 000000
18 8
Ġ1 62
05 3
35 4
05 2
aa a
W allet
78 7
95 3
68 9
Ġ15 4
oun d
Ma tch
Ġ m
05 6
Ġ8 0
94 2
68 7
73 0
11 27
00 9
74 9
15 8
Ġ factory
08 7
58 6
Ġ14 2
k er
a tes
a ke
Ġ13 7
18 1
c ul
Ġ18 4
Ġ14 7
06 7
04 0
18 4
xe c
Ġ9 0
leg ates
Token Transfer
77 9
06 9
fc fff
u t
22 6
06 0
B u
1 28
01 9
xf e
34 3
15 5
03 0
Ġre move
Ġ35 0000
f ee
1 18
35 5
Ġ1 20
78 0
re move
Ġ15 2
34 2
Re ser
Ġ15 6
x ab
23 0
[] )
[] )':
35 2
n ew
Ġ18 5
71 0
02 9
ker ProtocolFee
35 8
Ġ1 76
75 0
74 0
Ġ25 000000000
92 9
i e
92 0
64 9
Ġ18 1
4 03
04 9
64 0
66 9
93 9
78 9
11 1
In f
05 0
77 0
Ġ18 3
96 0
g ist
14 4
61 9
24 0
774 1
06 00
ro w
08 0
68 0
IN I
33 6
ea m
98 9
T eam
34 5
28 9
al cul
33 3
34 4
Ġ1 0000000000000000
Au ction
bu y
alcul ate
w ard
it i
Ġ2 01
2 02
206 06
i ty
co m
ase URI
14 3
72 0
Ġ1 92
Con troller
07 0
lock ed
e fb
A dd
91 0
Ġ2 04
Ġs upportsInterface
C o
Ġapprove AndCall
Ġ un
approve AndCall
05 7
148 54
f cb
nable d
S ig
Ġ11 0
26 0
95 0
32 6
xb f
09 0
91 9
vis or
T O
8 73
Ġ1 00000000000000000
Ġ acceptOwnership
s upportsInterface
St art
365 68
fdd f
22 2
5 58
54 7741
5 54
Ġ1 77
66 0
Ġ3 00000
99 0
D i
E nabled
fa e
Ġ---- -
Ġ6 000000000
07 9
Ġ14 0
94 9
ist ribu
Ġ13 9
ER C
Ġ15 9
1 00
xb c
Ġ1 98
00000000000000000000000000000000000000000000000000000000000000 2
Ġ13 0
Ġ18 7
de posit
34 1
65 0
M ain
igra tion
Ġ1 99
94 0
15 1
08 9
Transfer s
Ġ14 9
48 6
le aseA
Ġ18 6
s w
bc d
dd d
14 1
Ġc laim
98 65
45 6
TI AL
INI TIAL
09 01
eb b
Ġ15 7
22 7
18 5
x change
ca p
26 7
Ġ2 44
row d
4 08
54 6
35 6
33 1
Ġ5 58
ord er
White list
95 9
db b
t ribu
Ġ upgrade
15 4
Ġ18 2
D E
Ġ2 00
26 9
Ġ1 79
Ġ8 0000
Ġ12 0000
Ġ15 000000000
mint ingFinished
Ġmint ingFinished
Ġ12 0000000000
R ound
32 2
t ime
ra c
34 7
8 58
31 2
31 3
am p
K EN
a ce
16 7
M ulti
Ġowner Of
st amp
E nd
ance l
W ith
48 5
Time stamp
000 1
35 1
15 3
fun ding
Ġde legate
908 3
Reser ves
31 9
000000000000000000000000000000000000000000000000000000000000000 2
Ġ2 08
to kens
ur rent
Ġsw eep
E th
ffffffffffffffff ffffffffffffffff
Ġ b
x ff
Ġto kens
Of Owner
4 01
la test
15 2
11 6
Ġ2 05
01 24
000000000000000000000000000000000000000000000000 000000000
54 8
Ġ42 000
Au th
st art
31 6
h as
Ġ con
22 0
Ġ1 70
Ġ WETH
a af
u i
Pro xy
x ce
C reation
Ġ15 0
55 5
04 05
ro ze
15 6
Ġf inishMinting
f inishMinting
roze n
N ame
88 4
E ther
e nd
x cb
Ġ1 96
000000000000000000000000000000000000000000000000000000000000 01
54 5
965 0
v o
44 9
14 0
new Owner
11 9
05 9
y s
R E
f de
I C
14 6
x aa
18 6
Ġset ApprovalForAll
54 4
9865 0275
Ġ8 000000000
44 8
s c
11 2
54 3
54 1
vali date
Ġ2 03
901 0
u th
Ġget Reserves
00000000000000000000000000000000000000000000000000000000000000 4
Ġ25 00000000
Ġ3 00000000
Ġ1 000000000000
Ġ16 9
58 4
Ġ4 65
eeeeeeee eeeeeeee
44 5
Ġst art
xb d
14 7
76 000
36 2
Ġ16 0
f reeze
rac le
at a
Ġ22 000000000
sw eep
32 0
58 8
33 7
44 1
Ġc reate
48 4
314 0
Ġ 256
V ali
Ġ1 00000000000
22 9
com m
fun d
de legate
Ġ18 9
Ġ2 25
48 2
TI ON
ce f
11 3
i p
e ve
44 4
45 1
3 995
inali zed
494 04
18 7
88 8
4 659
12 210
Ġ max
ce nt
A P
De posit
48 1
34 0
27 9
Ġ2 21
leaseA gent
ce ss
80 38
48 3
up date
ie nt
5 71
Ġ1 90
ip ient
St ate
54 9
p tion
2 00
Ġ21 0000
4 72
Inf o
Tra ding
18 0
e ce
ol d
Ġ2 24
k ill
32 7
latest Round
15 7
82 05
000001 459
41 3
r y
d ac
58 1
R ew
Ġ2 31
P re
14 2
Ġf ee
7 21
c reate
Add r
xc f
R ec
Ġ2 34
ct i
te am
Rec ipient
9 24
Rew ard
55 3
c ca
ce ive
913 93
C ap
54 7
Ġ2 33
5 78
000000000000000000000000000000000000000000000000 00000000000
Ac cess
u te
58 3
53 91393
Ġ42 0000
Ġ pro
45 2
o ut
Ġ4 61
sc ri
36 0
an a
on TokenTransfer
27 0
05 05
Ġ2 23
To tal
31 0
36 7
scri ption
Ġ5 0000000000000000
Ġ2 35
C an
un ity
33 0
C l
Ġis ApprovedForAll
9 72
ca f
vo ke
set ApprovalForAll
is ApprovedForAll
B aseURI
29 03
55 1
eb e
Ġ24 000000000
67 9
Ġ51 000000000
33 9
Ġ min
45 3
98 04
Ġ18 0
D a
inali ze
Ġ w
Ġ21 8
756 983
16 9
b af
16 94
xfe af
F ill
45 5
000000000000000000000000000000000000000000000000 000
Ġ2 28
Lock ed
owner Of
3 72
15 0
pend ing
Vali dator
ves tor
c cb
Ġ2 38
Ġ1 97
xb b
5 26
o ri
000000000000000000000000000000000000000000000000 00
f t
xec ute
16 2
8 31
11 7
K e
Ġ2 06
1 93
Ġ2 88
53 9
vali dator
54 2
iti ali
Ġtoken Fallback
b ab
Ġis Owner
52 68
token Fallback
is Owner
I T
35 0
31 7
6 07
000000000000000000000000000000000000000000000000 0000000000
OfOwner ByIndex
S h
Ġ21 5
13 7
Ġ2 02
p u
ca e
e s
6 02
84 0
00000000000000000000000000000000000000000000000000000000000000 6
9 03
44 2
Ke ys
q ui
as t
9 21
xa e
88 7
token URI
Ġtoken URI
dis able
5 23
Agent s
Ġ21 4
TO KEN
Alloca ted
f aa
Ġ12 000000000
Ġget Approved
04 64
11 0
get Approved
8 25
84 3
Ġ2 48
Ġ4 00000000000
en ce
Ġ4 88
67 0
F inalized
pe n
85 2
54 0
ra ge
45 7
14 9
to rage
U n
0000000000000000000000000000000000000000000000000000000000000000 1
34 9
Min imum
t ing
Tra de
T a
Ġ2 61
58 2
Ġ35 000000000
7 714
vis ers
Ġ2 75
745 00
00000000000000000000000000000000000000000000000000000000000000 8
1 61
35 9
l ast
6 288
36 9
gist ry
b de
6 24
00 160
3 969
E xchange
65 21
pend er
M igration
as ed
41 2
has h
5 00
586 09
fc d
Mint ed
61 01
32 9
dra ft
ver draft
Ġ3 01
ment Amount
57 970
8 38
403 17
408 84
s Enabled
time out
C E
j in
jin Team
93 74500
vailable Funds
racle Count
6288 06
T E
ch i
ge n
g er
pe d
41 7
Ġpu ll
Ġ1 000
000000000000000000000000000000000000000000000000 0000
ra nt
s top
Ġs top
an da
pu ll
anda rd
0600 20
tribu te
Ġ5 01
Ġ21 1
l ush
de legates
Ġde legates
8 13
ro p
1694 505
Ġ1 000000000000000000
d ff
Ġ6 91
S et
Ġ3 15
5 755
rowd sale
55 2
55 6
Ġ4 85
81 9
Upgrade d
44 3
44 6
le ased
Upgrade Master
i d
Ġs afe
Di ct
bl ack
86 0
xb a
Upgrade Agent
68 764
im it
58 7
ancel Order
Ma kerProtocolFee
validate Order
Can Match
Ta kerProtocolFee
Ġ21 3
Ġ2 43
s torage
( {'
} )
At tribute
storage Keys
Attribute Dict
Ġ2 07
Upgrade State
5268 389
G rant
13 0
Ġ [
n o
88 3
9 73
51 7
5755 29
2 38
Ġ105 000
I M
53 7
Ġ2 64
3 73
tra de
bb e
0 99
dd b
d istribu
Ġ2 41
s afe
f af
Ġ2 68
ac b
L imit
1 94
Ġc alculate
q ue
Ġde stroy
xd b
8 28
f ir
Ġ7 0000
dd c
Fund Deposit
Ġ2 45
b ce
y ERC
add Minter
Ġadd Minter
5 65
50 23
3 15
Ġ buy
de stroy
Bu rn
85 1
fc c
x ee
Re ceive
m er
Ġ5 00000000
ord ers
Ġ2 73
w ap
61 00
48 7
Ġset Owner
u b
0 21
01 56
ad visers
A TE
comm unity
B A
set Owner
d ab
4 38
13 9
00000000000000000000000000000000 000000000000000
Ġ2 00000000000
S E
c alculate
fb b
e x
30 68
4 14
Ġ3 33
Ġ11 000000000
Ġ2 26
00000000000000000000000000000000 00000000000000
Ġ2 22
RE S
8 05
88 5
55 0
ff d
L O
Ġ3 05
en able
Ġ21 6
Ġ2 74
Multi ple
58 9
Ġ21 2
Ġ2 63
15 9
le ct
78 23
L eve
33 18
Leve l
Ġ2 99
Ġ21 7
Ġ7 000000000
56 0
4 21
f dc
Ġ2 65
D ate
C urrent
46 0
Ġ2 91
88 2
Ġ2 09
C ON
84 9
15 26
ana ger
B U
23 00
88 1
Ord ers
W ithdraw
With Re
Da y
4 04
55 7
xe a
ver n
go vern
ed a
58 0
n ap
44 7
db d
b ec
44 0
Ġe nable
3 35
V ER
Ġ4 63
43 7
Ġ2 00000000000000000
itiali ze
ff e
ch e
gist er
Ġ4 0000
ca b
Ġ28 000000000
f ec
a ee
2 03
fer ence
Ġ2 93
Ġ41 000000000
1 95
change Fee
Ġchange Fee
6 00
8 76
WithRe ference
84 7
76000 80
5 99
visor s
Ġ lock
C I
f ac
fcb af
9 00
Ġ4 23
Ġtransfer AndCall
c ac
8 08
Ġ25 5
MA L
DE CI
DECI MAL
F a
Ġre lease
4 91
Ġ2 32
00000000000000000000000000000000 000000000000
Ma x
s Addr
2 000000000000000000000000
b ed
6 63
fb c
f db
re lease
6 95
Ġ3 04
9 04
Ġ INITIAL
Ġis Minter
T ake
is Minter
an Upgrade
Ġ2 94
Ma ke
e cb
ar get
ff c
R eb
Reb ate
Ġ2 71
a ed
Level sAddr
Ġ3 75
S e
x ed
xc d
000000000000000000000000000000000000000000000000000000000000000 4
Ġ order
Ġ45 000000000
25 21
ct ive
258 01
xca b
b ee
Ġ4 64
transfer AndCall
xf c
84 6
m it
Ġ7 73
Ġ25 1
8 34
7 61
cc d
81 346
6000 526
Ġ2 27
I s
Ġ2 95
858 183
42 712
Ġ3 18
fde ed
Ġ2 36
49 616
Ġ2 98
c dc
f eb
af b
88 6
Ġ9 000000000
0000000000000000 0000000000
000000000000000000000000000000000000000000000000 000000
48 0
x dee
e ca
1 73
a cti
7 04
fd f
c fb
3 214
d ca
Ġ3 03
Ġ2 42
xe fdeed
Ġ4 95
Ġ45 6521
Ġ5 00
D istribu
585 733
85 6
49616 997
A r
Ġ2 78
000 2
l y
000000000000000000000000000000000000000000000000000000000000 0
c fc
000000000000000000000000000000000000000000000000000000000000000 3
ff a
85 7
2 65
6 01
4 92
51 0
1 36
6 04
Ġ2 0000000000000000
e ab
Ġ25 8
IC AP
Bu y
n e
S T
T y
Ġ3 08
Ty pe
7 23
1 68
Ġ AttributeDict
66 68
}) ,
Ġ2 47
55 9
Ġ4 14
08 01
x de
Ġ cap
Ġ4 35
ee d
38 38
a ab
Ġf reeze
l o
6 99
Ġ18 000000000
Ġ[ '
fb e
Ġ funding
Ġ52 000000000
' ]
x dd
Ġe xecute
To ICAP
Ġ25 2
cent i
pa rent
Ġpa rent
494 6
3 01
Ġ2 37
Ġ3 28
48 9
1 01
66 24
6 65
black list
2 21
A ctive
8 35
ma tion
85 3
l isted
0 74
3318 585733
04 36
ad a
i rd
2 71
Ġ3 68
ke ting
ad c
41 9
8 00
g th
b cc
51 9
db a
75 71
Ġ------ --
07 91
9999 9999
pl it
Ġ3 35
Auth ority
L en
Ġ4 11
f ab
S I
Ġ25 3
Ġ2 29
Ġ2 46
ird rop
min ate
Ġ2 66
Ġ4 99
vestor s
0156 00
uth ority
centi vis
81 7
1 99
Ġ newOwner
Ġ2 39
5 64
Ġ3 74
Len gth
cf e
45 0
b cb
41 0
Ġ3 0000
Fa ctory
Fill s
Ġ26 000000000
000000000000000000000000000000000000000000000000 0000000
43 0
ff b
no minate
Ġ55 000000000
Ġ3 99
de b
Fund Address
6000526 015600
d ce
751 039
L IM
d cb
LIM IT
8 18
Ġ33 000000000
Ġ13 000000000
a eb
v ate
Sig n
3 94
9 61
1 15
P RI
04 98
84 2
fb a
Ġ16 000000000
b ac
Ġ3 14
Ġ3 24
Start Block
63 99
Allocated To
n jinTeam
centivis ation
0 71
b ef
dd e
R A
99 45
Ġ25 4
Trans action
b fd
Ġ9 0000000000
f ed
t u
in al
Ġ27 000000000
9 23
Ġ latestRound
End Block
e ac
Ġ3 45
gen c
gra nt
mer genc
5 95
tu rn
a ec
PRI CE
a ac
token Creation
Ġtoken Creation
b eb
72 76
Ġ update
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
63 74
3 78
b fa
Ġ2 79
Ġ21 9
1 24
Ġ14 000000000
56 9
015 61
7 99
1 78
Ġ5 00000000000000000
1 04
de f
Ġ6 95
xe b
Ġ2 20
uth ori
pending Owner
ne ctor
Ġ4 71
Ġ21 0
72 74
Ġ3 91
co ver
que st
Ġ3 21
02 00
Ġ3 38
O n
Ġ23 000000000
46 9
ce a
R an
b da
Re leaseAgent
24 61
Transfer Agent
a ea
t ers
y er
3 63
Ġ4 68
ad b
Ġ32 000000000
withdraw Funds
Ġwithdraw Funds
8 94
88 9
Ġ3 31
Ġ36 000000000
Ġ9 25
rozen Account
O r
Ġ3 48
ed f
Ġp ush
ves ted
1 21
Ġ4 21
73 05
Ġ3 78
Ġ3 00
U N
75 0000000000000
0000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000
1 25
ge ner
Ġ3 34
0 92
4 74
ab a
d fd
transfer Admin
Ġtransfer Admin
ab b
Ġ2 62
qui re
7 08
36 06
cb b
pa y
06 0405
Ġ3 64
Ġ3 44
C laim
p ush
Ġ4 91
Ġ5 04
Ġ3 95
3 38
All owed
Receive d
6 93
Ġ8 0000000000
aa e
E xa
DE L
Exa ct
to m
or mation
Ġ84 000
bb b
Ġ105 2
5 02
6 68
ca d
Inf ormation
N ew
Ġ31 000000000
c dd
b dc
Ġ4 05
2 95
9 74
Ġ onTokenTransfer
Exchange Rate
ec f
0 98
3 23
7 28
8 14
xf d
To Whitelist
cb f
fir m
0 75
D A
Ġ4 86
V ersion
Ġ team
Ġ4 75
2 98
F rozen
Ġ3 65
Ġ2 49
ic i
iti al
a ef
e dd
8 44
d fc
7 73
B et
f da
0 95
Ġ3 25
Ġ4 94
tom ic
p y
tomic Match
7 78
e ff
Co py
db c
ba tch
Ġ5 21
Ġ2 72
ea e
Re lease
5 98
1 34
test Copy
Ġ5 99
CON T
77 78
hite list
Ġ kill
28 78
8 15
21 98
Ġf inalize
M anager
S nap
ver t
Ġ3 23
Ġ3 61
af d
Ġ94 813
3 61
Token Information
a re
Ġ28 5
1 713
ce b
gener ate
Ġ4 08
ĠT O
Current Price
8 03
A D
1 02
7 38
Ġ ma
a de
Ġ3 0000000000000000
0 61
o re
1 14
25 0000000000000
Ġget Timestamp
7 03
Ġ3 55
Ġ4 15
Ġ3 94
000000000 5
6 08
A n
Ġ3 58
T AL
f or
5 73
b dd
con troller
ance ll
ea ec
7 25
db f
o de
reation Block
M E
3 28
3 18
7 94
get Timestamp
S ub
Ġ2 69
Ġ4 62
de scription
fb d
Ġ2 92
Ġde scription
Sig ner
Ġcon troller
ef e
