#version: 0.2
0 0
Ġ '
00 00
' :
o n
0000 0000
c t
c e
a l
i on
ct ion
u n
f un
Ġ ;
fun ction
Ġ' ,
r a
r e
e r
s s
t ra
i n
d d
a s
v i
e w
vi ew
Ġ view
re ss
dd ress
Ġ 1
' ,
00000000 00000000
a ddress
) ':
b l
r i
2 5
{ '
Ġ 0
i s
[ {'
} ]
g as
d e
p a
in t
on ce
n once
t y
n s
u int
al l
25 6
tra ns
c k
a n
Ġ 2
Ġ pa
an ce
bl e
a ble
P ri
c h
Ġpa y
Ġpay able
p l
u s
u e
Ġ 3
m b
( )
( )':
al ance
b alance
v al
e e
s e
on e
I n
N one
o ck
p e
c on
tra ct
Pri ce
g o
con tract
de x
In dex
pl us
go plus
r o
mb er
u mber
N umber
a ction
bl ock
val ue
trans action
ty pe
gas Price
block Number
transaction Index
c all
0000000000000000 0000000000000000
a in
I d
ch ain
chain Id
Ġ call
F ee
m a
ma x
Ġ F
al se
ĠF alse
P er
ri ty
G as
Fee Per
FeePer Gas
00 0
t o
tra ce
f er
00000000 0
trans fer
Ġ 4
t e
Ġcall trace
f f
ro m
Ġ 5
a c
o w
b a
6 1
is t
7 1
9 9
6 5
0 1
2 8
n er
0 5
L ist
7 5
] ,
6 8
6 4
6 3
2 4
7 4
2 1
7 3
Ġ to
9 4
0 3
9 5
2 3
7 8
0 4
9 1
P a
0 8
9 8
9 3
[ ],
ac ce
o rity
y Pa
acce ss
yPa rity
access List
max Pri
max FeePerGas
ority FeePerGas
maxPri orityFeePerGas
Ġ [],
Ġ _
t ch
u p
ba ck
d is
all back
' }]
tch er
dis pa
dispa tcher
00000000 0000
f allback
v e
00000000 00
te s
Ġ transfer
p ro
0 2
i m
Ġ2 1
p pro
ow ance
y tes
b ytes
1 8
O w
Ow ner
de c
1 5
- -
Ġ 8
0 6
Ġ3 8
Ġ1 5
f rom
00000000000000000000000000000000 0000000000000000
e d
o l
3 3
7 2
1 4
O f
7 6
Ġ3 7
t al
F rom
m e
g e
3 8
6 6
pl y
ppro ve
S up
Sup ply
3 5
4 5
balance Of
tal Supply
9 2
c a
4 8
3 2
1 1
h i
Ġ p
9 6
a pprove
c o
Ġp u
7 7
Owner s
Ġ 6
hi p
Owners hip
l l
a me
k e
Ġpu re
3 4
as e
8 5
T o
n ame
y mb
ymb ol
s ymbol
9 7
2 2
Ġ21 000
Ġ' _
al s
dec im
decim als
ff ff
all owance
Ġ1 4
l a
0 7
8 8
Ġ T
2 6
ase A
co de
000000000000000000000000000000000000000000000000 000000000000
r ue
" {'
" }]
} "}]
Ġ "{'
Ġ' }"}]
ĠT rue
Ġ"{' _
Ġ1 1
re aseA
3 1
4 4
ow ner
0 9
f e
5 5
Ġ1 8
3 6
a d
se t
t h
Ġ 9
2 7
f a
ge t
1 6
B la
Bla ck
Ġ balanceOf
2 0
5 4
n d
x d
a b
Ġ --
g ra
8 4
to talSupply
x b
9 0
Ġ 7
f b
Ġ 25
x e
ll owance
f c
reaseA llowance
5 8
d a
s t
us e
00000000000000000000000000000000 00000000000000000000000000000000
To ke
Ġ1 3
2 9
gra de
Ġ approve
b u
4 1
6 7
d b
8 1
o r
Ġtransfer From
a a
n t
Ġ2 000000000
7 0
in g
6 2
Ġto talSupply
Ġ2 8
d c
x c
x f
transfer From
Ġ name
1 3
Ġ symbol
7 9
b b
Ġ re
Ġ1 2
Ġ decimals
o un
r n
m in
8 2
Ġ allowance
up grade
0000 0
call trace
e c
1 2
x a
f d
4 3
Ġ2 0
in c
bu rn
m int
e b
ffff ffff
4 6
pa use
5 3
a t
c c
Ġ owner
Black List
e a
5 6
5 1
Ġ2 7
3 0
Ġ1 6
te d
Ġ -
3 9
e f
Ġ get
3 7
Ġ set
Ġ de
000000000000000000000000000000000000000000000000000000000000 00
b c
5 0
1 7
a te
5 2
Ġ' }]
5 7
8 6
4 2
4 7
Ġ e
0000000000000000 00000000
Ġ9 0000
T ra
an ge
ch ange
8 0
4 9
Ġ1 7
000000000000000000000000000000000000000000000000000000000000 000
Ġ2 0000000000
us ed
6 9
8 3
c f
1 9
i th
Ġtransfer Ownership
transfer Ownership
ppro val
1 0
6 0
d ra
b f
71 28
0000 000
A ddress
00000000 000
Ġ15 00000000
b d
dec reaseAllowance
inc reaseAllowance
Ġ1 0
8 7
Toke n
Tra ns
oun ce
n ounce
nounce Ownership
l e
Ġ20 7128
a f
4 0
Ġ s
p re
dra w
ith draw
i t
th er
5 9
Toke ns
Ġ se
d f
un pause
pre ca
ke n
o ol
Trans fer
C all
a dd
c b
w ithdraw
Ġse nd
b ool
upgrade To
A nd
er s
Ġ1 000000000
reaseA pproval
m o
8 9
un d
Ġe ther
a r
b e
mo ve
000000000000 000
a e
And Call
F und
A d
at ion
0000 00
c d
M int
Ġ1 9
Ġ1 02
S t
I N
Ġ mint
A ll
Ad min
Ġ2 2
Ġ2 4
Ġ1 00000000
Ġ burn
Ġ3 5
Ġ is
me nt
u m
R e
Ġ-- --
000000000000 00
de e
M A
Fund s
im um
r ing
ffffffff ffffffff
F or
Ġ None
ee ee
pl e
t ion
to r
Ġ c
ro y
Ġ2 3
st roy
Ġ 63
a fe
Ġ4 5
l ock
R ate
ad min
Ġ4 2
balance s
st ring
MA X
5 05
ow ed
Ġ 94
ple ment
Ġ 65
plement ation
Ġ25 0000
Ġ 99
000000000000 0
00 1
ss ue
Ġ3 1
Ġpa used
Ġ5 0000
pa used
Ġ102 000000000
p o
all owed
Ġ 61
Ġ-- -
is ted
Ġ2 6
Ġ 75
Ġ change
IN T
i ssue
im plementation
t er
99 5
Pa ra
Ġ decreaseAllowance
Ġ increaseAllowance
64 4
Ġ 73
ers ion
dee m
Ġre nounceOwnership
re nounceOwnership
Ġ5 5
Ġ1 05
im e
is h
Ġ 74
Ġ3 4
Ġpa use
at us
Ġ 64
r d
St atus
01 5
z e
P o
L isted
Ġ 68
7 91
Ġ withdraw
max imum
po s
d Address
Ġ1 04
Ġ4 1
m s
Ġ unpause
U INT
Ġ5 1
Para ms
preca ted
preca te
Po int
in ish
Black Listed
Point s
as is
maximum Fee
asis Points
add BlackList
move BlackList
b asisPoints
Black Funds
basisPoints Rate
BlackList Status
stroy BlackFunds
Ġ3 3
upgrade dAddress
to ken
Ġ 71
Ġto ken
75 1
Ġ 78
v ersion
61 5
Ġ4 8
Ġ1 00
C on
Ġ3 6
Ġ3 2
e t
Ġ1 18
Ġ f
a p
Ġ upgradeTo
Ġ1 21
9 08
Ġ1 00000
7 95
ct or
98 4
inc reaseApproval
Ġ4 4
dec reaseApproval
Ġ1 01
Ġ1 15
pos it
oun t
A pprove
A c
_ (
Ġ 95
75 6
7 00
03 8
R I
Ġ4 6
Ġ1 08
5 15
ge nt
al e
Ġ2 9
Ġ5 0000000000
P ro
4 94
0000000000000000 0
3 05
Ġ1 24
U p
Ġ1 35
Mint er
For All
Transfer From
000000000000000000000000000000000000000000000000000000000000000 1
Ġ4 3
71 9
Ġ 91
25 9
0000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000
T ime
Ġ 93
Ġ1 23
Ġ5 4
Ġ1 03
al i
Ġ1 28
M a
24 8
co un
1 73
Ġ1 14
ctor y
Approve d
coun t
Ġ 66
Ġ3 9
le g
Ġ5 3
Ġ1 38
Ġ1 25
afe TransferFrom
Up grade
71 4
Ġ1 33
00 4
Ġ 98
97 9
Ġ5 8
nonce s
74 5
la im
94 7
9 01
74 1
Ġ3 0
Ġ5 2
9 05
Ġ1 65
ar t
6 000
Ġ5 00000
Ġ 72
2 23
9 68
Ġ3 000000000
E T
t s
Ġ1 45
000000000000000000000000000000000000000000000000 00000000
Ġ1 68
0 63
O rd
u l
61 6
Ac count
9 65
99 99
Ġ4 7
Ġ5 6
de d
fa ctory
Ġ1 48
U RI
2 06
ET H
Ġ1 94
Ġ8 4
3 65
A gent
Ġ1 34
[ ]
0 24
p t
00 2
28 8
75 5
78 2
25 8
Ġ1 74
00 5
Ġ4 9
21 4
Ġ1 85
21 8
Ġ1 11
Ġ1 61
p or
Ġs w
3 24
7 64
Ġ1 93
Ġ1 95
x ba
Ġ 76
01 8
Ġ admin
4 61
Ġ balances
Ġ3 0000000000
00 8
21 7
Ġ1 73
f dd
Ġ21 000000000
o ca
A u
Ġ1 64
eeee eeee
Ġ MAX
In ter
Ġ1 0000000000
Ġ6 0000
Ġ 77
c u
fa ce
91 3
E R
2 05
Inter face
acce pt
Ġ4 0
Ġ1 71
ul t
ar d
6 04
x ad
Ġ1 63
61 1
up por
uppor ts
x fb
Ġ5 0
upports Interface
Ġ1 91
Ġ 96
24 4
23 8
Ġ1 78
Ġ6 2
Ġ8 8
6 00
ce c
ve s
03 1
3 14
93 8
c ol
ra tor
21 0
Ġ allowed
Ġ implementation
Ġ8 1
Ġget Owner
get Owner
74 8
All oca
B lock
68 1
Ġ8 5
95 8
Ġ2 00000
Ġ5 7
71 8
Ġ1 88
4 65
Ġ issue
n able
A L
98 3
ri bu
Ord er
21 5
Ġ1 75
Ġ a
00 3
99 7
b db
Ġ1 31
i g
74 6
accept Ownership
71 1
28 5
Ġ 92
73 3
45 9
25 3
Ġ1 22
vi s
0 61
l ist
25 4
Ġre deem
da te
m ount
63 5
25 5
78 5
24 9
24 5
v er
23 5
68 8
re deem
0 91
68 5
71 5
04 5
64 5
25 1
28 4
99 8
78 4
T I
ff f
23 4
F inish
98 5
c ba
Finish ed
03 5
04 8
03 9
75 8
08 8
0000000000000000 000000000
71 3
Ġ1 32
99 1
01 1
change Admin
Ġchange Admin
71 2
Ġ1 06
73 8
B alance
3 644
0 94
Ġ6 7
63 3
pe rator
01 6
64 8
65 5
ro ll
de precate
Ġde precate
25 2
de precated
Ġde precated
78 8
Ġis BlackListed
is BlackListed
set Params
Ġset Params
Ġ maximumFee
to col
Ġ addBlackList
re moveBlackList
Ġre moveBlackList
Ġ basisPointsRate
75 4
78 1
get BlackListStatus
Ġget BlackListStatus
de stroyBlackFunds
Ġde stroyBlackFunds
Ġ5 9
Ġ upgradedAddress
tocol Fee
74 2
P L
08 3
xd c
08 2
S U
73 5
23 1
d ing
21 1
ee p
93 5
98 8
04 4
16 0
00000000000000000000000000000000000000000000000000000000000000 1
i l
28 2
94 4
SU P
PL Y
SUP PLY
x fa
61 4
ad f
91 5
hi te
xa f
01 4
72 6
73 4
x ca
65 6
99 4
96 2
97 0
1 18
74 4
65 4
63 4
Ġ6 9
W ETH
roll er
65 8
val i
ing Finished
63 8
Mint ing
03 6
95 5
s er
ke ns
21 6
91 8
re nt
85 4
03 3
01 0
Ġ1 26
21 95
B y
65 2
03 4
94 5
99 3
61 8
73 1
08 5
28 1
D e
A pproval
68 4
Ġ1 36
63 2
93 4
08 1
Ġ increaseApproval
Ġ decreaseApproval
upgradeTo AndCall
ĠupgradeTo AndCall
Ġ11 6
02 2
98 1
Ġ---- --
08 4
96 9
25 7
63 1
61 0
04 1
leg ate
A t
24 1
95 4
tes t
Ġ st
95 1
i ll
Ġ4 0000000000
94 8
ac cf
a m
63 9
23 3
Ġ1 0000000000000000
A mount
t roller
64 1
05 8
re ate
72 7
00 6
61 2
Ġ8 3
76 2
Ġ6 0
24 7
04 6
Ġ version
63 6
06 00
99 6
92 6
Ġ8 2
to tal
05 4
64 3
Ġde posit
Ġ1 07
inish Minting
Ġ 97
05 1
Approval ForAll
61 3
Ġto tal
Ġ8 6
23 2
66 6
u r
68 2
65 3
93 82
99 2
93 1
54 7
i r
05 5
75 3
18 2
21 3
65 1
72 2
71 6
88 03
91 1
re e
all et
28 3
Ġ14 1
Ġ1 27
i ve
91 4
78 3
Ġ11 3
Ġ4 000000000
18 5
or d
173 9
23 6
02 75
Pro tocolFee
64 2
01 2
0 68
O N
db ee
S ale
2 751
04 2
i c
64 6
78 6
i gra
ffffffffffffffff ffffffffffffffff
21 2
Ġburn From
Ġ1 66
98 6
ab de
M in
Ġ add
xba a
74 3
burn From
2 979
x ded
03 2
76 6
Ġs afeTransferFrom
cba fe
72 9
33 700
Ġ15 5
25 0
38 9
to p
73 6
93 3
5 984
Alloca tion
2195 995
7 94
02 6
e ad
c da
24 3
28 0
18 3
Ġ5 000000000
98 0
Ġsw ap
Approved ForAll
Ġ11 2
v a
fb f
o d
24 6
91 6
24 2
14 5
Ġ14 4
E N
04 3
i e
Ġ7 9
Ġ8 7
in ali
28 6
75 9
x ac
73 2
63 7
35 3
94 1
02 0
75 2
Ġ11 7
66 2
Ġ8 9
Ġ in
93 2
76 7
68 6
01 3
Ġ15 8
95 2
28 7
0000000000000000000000000000000000000000000000000000000000000000 000000000000000000000000000000000000000000000000
Ġ15 0000
35 7
34 6
77 7
76 0
Ġ nonces
65 7
i od
61 7
00 7
93 0
68 3
75 7
C ount
93 6
91 2
64 7
O perator
By Index
23 7
Per iod
21 9
ab e
Ġ1 09
x y
08 6
26 2
5 20
74 7
aa a
s ale
ult i
da tor
W hite
s afeTransferFrom
c laim
99 9
06 2
85 8
0000 01
63 0
98 7
93 7
as ter
Ma tch
z ed
us h
9 03
Ġ1 67
pe nd
05 2
71 7
02 7
x fe
M aster
98 2
Ġ7 0
92 2
k er
o t
ree ze
Con tract
15 8
18 9
95 6
le ase
1 28
76 000
76 9
96 7
73 7
92 7
06 6
e n
68 9
18 1
cu la
05 05
W allet
Ġ15 1
xd f
03 7
95 7
Ġ m
re ation
da f
F allback
95 3
Re ser
Ġ factory
01 7
Ġ o
15 5
94 6
f ee
94 3
00000000000000000000000000000000000000000000000000000000000000 2
Ġ14 3
Ġ1 29
Ġ11 9
04 7
74 9
23 9
05 6
Ġ15 4
Ġ6 0000000000
Ġ14 6
78 7
18 8
55 8
Au ction
L ock
va il
vail able
00 9
65 9
35 4
05 3
73 9
Ġ---- -
08 7
94 2
23 0
u t
ker ProtocolFee
73 0
04 0
91 7
Ġ8 0
48 5
68 7
a ke
Ġ1 000000
Ġ1 72
64 0
oun d
01 9
06 7
92 9
22 6
64 9
06 0
ba f
55 4
Ġre move
leg a
Ġ15 3
11 1
B u
77 9
4 03
15 26
96 0
re move
D i
Ġ14 2
28 9
11 27
93 9
n ew
33 5
34 2
18 4
[] )
[] )':
34 3
Ġ14 7
02 9
75 0
al cula
04 05
08 0
alcula te
74 0
35 5
48 6
Ġ18 4
Ġ1 20
Ġ25 000000000
98 9
Token Transfer
06 9
lega tes
Ġ13 7
bu y
fc fff
71 0
C o
45 6
x ab
48 8
000000000000000000000000000000000000000000000000 000000000
Ġ9 0
92 0
S ig
Ġ35 0000
38 0
78 0
24 0
33 6
Ġ1 62
35 2
In f
33 3
it i
72 0
77 0
Ġ15 6
xb c
ase URI
03 0
66 7
78 9
14 4
Ġ18 3
48 2
Ġ1 76
Ġs upportsInterface
w ard
14 8
bc d
07 0
Ġ15 2
1 00
ro w
g ist
05 0
26 0
68 0
s upportsInterface
22 2
000000000000000000000000000000000000000000000000 00
91 9
58 6
000000000000000000000000000000000000000000000000 000
Ġ un
38 8
A dd
04 9
35 8
07 9
fa e
33 8
IN I
ist ribu
33 4
2 02
45 8
co m
Ġc laim
38 6
i ty
Ġapprove AndCall
approve AndCall
65 0
09 0
nable d
ea m
T eam
Ġ18 1
05 7
14 3
48 1
61 9
000000000000000000000000000000000000000000000000000000000000000 2
0000000000000000 00
000000000000000000000000000000000000000000000000 0000000000
St art
48 4
xb f
Ġ11 0
T O
e fb
Con troller
Ġ acceptOwnership
Ġ1 92
vis or
45 4
08 9
Ġ1 77
eeeeeeee eeeeeeee
95 0
ER C
15 1
95 9
t ribu
de posit
38 2
lock ed
E nabled
206 06
Ġ1 00000000000000000
n e
8 73
Ġ1 99
Ġ6 000000000
Ġ2 01
91 0
Ġ18 6
e bb
33 1
66 9
Ġget Reser
32 6
94 9
Ġ3 00000
dd d
45 5
ord er
db b
fdd f
38 5
45 1
a ce
34 4
Ġ2 04
Ġ14 9
14 854
22 7
31 3
Ġ1 98
Ġ15 9
99 0
ance l
4 01
365 68
547 741
x change
26 7
48 3
White list
14 1
w eep
Ġ13 0
4 08
26 9
igra tion
908 3
38 1
Ġ15 7
row d
le aseA
31 2
R ound
am p
TI AL
INI TIAL
y s
85 5
94 0
98 65
000000000000000000000000000000000000000000000000 00000000000
16 7
76000 80
81 3
Ġ13 9
st amp
Time stamp
W ith
Transfer s
E th
Of Owner
Ġ14 0
Ġ2 00
45 2
ca p
h as
61 01
la test
38 4
5 65
Ġowner Of
aa f
x ff
M ain
Ġ18 2
00000000000000000000000000000000000000000000000000000000000000 4
15 3
000000000000000000000000000000000000000000000000000000000000 01
15 4
ĠgetReser ves
Ġ15 000000000
Ġ18 7
000 1
D E
88 4
Ġ8 0000
0600 20
ra c
M ulti
Ġ WETH
Ġ12 0000
66 0
44 9
E nd
f de
05 9
Pro xy
11 6
mint ingFinished
Ġmint ingFinished
x ce
to kens
Au th
K EN
35 1
01 24
44 1
Ġ upgrade
Ġ2 33
Ġset ApprovalForAll
t ime
Ġsw eep
fun ding
Ġto kens
34 1
09 01
u i
8 31
Ġ2 08
18 6
45 3
Ġde legate
2 00
vali date
d ac
14 7
38 3
st art
44 4
965 0
N ame
15 2
31 6
Ġ12 0000000000
Ġ max
Ġ42 000
45 7
R E
C reation
e nd
s c
Ġ8 000000000
R ew
00000000000000000000000000000000 000000000000000
15 6
v o
31 9
34 7
84 1
Ġ1 79
55 5
Rew ard
48 7
i p
ze n
E ther
Ġ2 03
000000000000000000000000000000000000000000000000 0000
81 9
ro zen
35 6
14 6
5 78
32 2
Ġ2 05
Ġ con
22 0
Ġc reate
ce ss
9 24
ie nt
Ġ15 0
Ġst art
new Owner
Ġf inishMinting
f inishMinting
14 0
n ce
ip ient
ca f
x aa
Ġ1 00000000000
7 21
xb d
ct i
11 9
85 1
t ing
I C
465 9
f reeze
5 71
314 0
84 3
e ce
02 00
11 3
11 2
K e
Ġ16 9
18 7
fun d
u th
com m
TI ON
00 160
Ġ min
e ve
Ġ25 00000000
s weep
V ali
4 72
494 04
De posit
R ec
Ġ21 0000
ra ge
Rec ipient
p tion
27 9
inali zed
Ġ5 58
3 995
9865 0275
12 210
Tra ding
ce f
82 05
Inf o
33 2
ce nt
Ġ1 96
k ill
Ġ 256
000001 459
36 2
fc c
fa a
Ġ1 70
Ġ16 0
22 9
11 7
rac le
de legate
1 93
0 99
00000000000000000000000000000000 00000000000000
c reate
latest Round
Ġ4 65
5 26
33 9
0 21
ves tor
44 2
a ck
ce ive
eb e
Ke ys
Ac cess
15 7
54 6
w ap
Ġf ee
Ġis ApprovedForAll
Ġ3 00000000
Ġ pro
38 7
xe cu
88 8
ffffffffffffffffffffffffffffffff ffffffff
ba b
85 2
set ApprovalForAll
is ApprovedForAll
Add r
r y
0000000000000000000000000000000000000000000000000000000000000000 1
00000000000000000000000000000000000000000000000000000000000000 6
901 0
ur rent
P re
A P
Ġ18 9
ca e
to rage
Ġ1 000000000000
Ġ22 000000000
C an
Ġ2 25
sc ri
up date
14 2
ol d
B aseURI
scri ption
33 7
Ġ2 21
8 038
Ġ21 5
leaseA gent
15 0
owner Of
Ġ w
S h
6 02
xc f
St ate
015 61
32 7
36 0
3 72
xecu te
Ġ2 35
Ġ2 31
67 9
16 9
C ap
98 04
fd f
b de
756 983
xfe af
To tal
36 7
Ġ2 23
88 7
o ut
6 01
c ca
44 3
F ill
Ġ2 24
te am
Ġ2 28
D a
pend ing
29 03
OfOwner ByIndex
1 61
tribu te
p u
as t
27 0
un ity
5 23
32 0
16 94
41 3
Ġ5 0000000000000000
vo ke
8 38
Vali dator
an a
iti ali
fc d
34 0
C l
xe a
vali dator
Ġ2 02
16 2
Di ct
Ġ4 61
ff d
Ġ51 000000000
token URI
Ġtoken URI
84 9
U n
Ġ1 90
q ui
s torage
Ġis Owner
At tribute
( {'
} )
storage Keys
Attribute Dict
is Owner
Ġget Approved
9 72
18 0
Ġ12 000000000
inali ze
get Approved
54 3
Ġ24 000000000
6 24
I T
Min imum
Ġ [
53 9
f t
on TokenTransfer
Ġ2 34
913 93
T a
11 0
c dc
Ġ42 0000
l ast
Lock ed
36 9
b cc
53 91393
54 1
06 0405
85 3
Ġ4 88
31 7
Ġ35 000000000
has h
S et
Ġtoken Fallback
e s
dis able
xa e
token Fallback
Ġ1 97
o ri
44 6
00000000000000000000000000000000 000000000000
44 7
8 25
b ce
33 0
F inalized
i d
8 05
88 3
bl ack
14 9
1 68
48 0
Ġ1 000
pe n
15 9
55 3
8 08
Ġ18 0
b ec
85 6
04 64
xb b
Ġ2 06
Tra de
bb e
85 7
84 0
13 7
84 7
15 61
b ed
Ġ4 00000000000
C E
TO KEN
6 07
n o
Ġ3 33
Ġ b
Ġ d
2 03
52 68
Ma kerProtocolFee
validate Order
Can Match
Ta kerProtocolFee
Ġ2 38
9 00
67 0
ro p
35 0
000000000000000000000000000000000000000000000000 000000
u b
Ġ2 45
31 0
Agent s
06 000
86 0
ancel Order
gist ry
im it
05 65
6 63
41 7
Alloca ted
8 28
Ġ2 75
58 1
vis ers
l ush
s top
Ġs top
44 0
pe d
d ff
88 1
34 9
1694 505
51 7
as ed
Ġ21 4
Ġ6 91
Ġc alculate
f dc
00000000000000000000000000000000000000000000000000000000000000 8
T E
46 0
dra ft
ver draft
Ġpu ll
Ġs afe
Ġ2 48
pu ll
L imit
ra nt
84 2
fa f
43 7
pend er
7 714
c bb
Ġ10000000000000000 00
745 00
Ġ buy
288 06
ra ble
E xchange
Ġ5 01
32 9
M igration
tra de
55 1
db d
88 2
Ġ21 8
41 2
ac b
x ee
3 969
85 9
rowd sale
dd b
an da
35 9
000000000000000000000000000000000000000000000000000000000000000 4
4 38
ch i
anda rd
le ased
dd c
d ab
ff e
f ir
57 970
ment Amount
586 09
time out
Ġ2 07
fb b
403 17
j in
jin Team
408 84
48 9
6 28806
93 74500
vailable Funds
racle Count
Ġ2 44
I M
c alculate
fe rable
Mint ed
Ġ2 73
ord ers
s afe
13 9
81 2
Re ceive
G rant
Ġ21 1
q ue
xd b
ca b
58 3
5 755
a ee
Ġde legates
78 23
de legates
B A
Ġ2 61
fb e
84 6
68 764
fb c
at a
g er
Ġ105 000
le ct
s Enabled
ed a
fe b
m er
Ġ2 64
Ġ21 3
50 23
5268 389
4 14
D A
8 76
W ithdraw
C urrent
ff c
Ġ2 22
Ġ11 000000000
xc d
Upgrade d
Upgrade Master
5 00
S E
Ġ7 0000
6 95
5755 29
Ġde stroy
f ac
000000000000000000000000000000000000000000000000000000000000000 3
30 68
e ab
Ġ3 01
Ġset Owner
23 00
9 21
Ġ2 41
Upgrade Agent
re d
ge n
y ERC
fc b
000000000000000000000000000000000000000000000000 0000000
xe c
13 0
de stroy
set Owner
55 2
4 04
Ġ3 15
53 7
45 0
Upgrade State
8 15
Ord ers
V ER
ad visers
comm unity
L eve
Leve l
Fund Deposit
c ac
Ġ7 000000000
56 00
Bu rn
Ġ AttributeDict
}) ,
2 000000000000000000000000
RE S
54 2
Ġ4 63
3 48
f db
Ġ2 65
ee d
1 95
Ġ2 26
88 6
Ġ3 05
cc d
itiali ze
add Minter
Ġadd Minter
3 73
4 21
Ġ2 63
L O
Ġe nable
55 6
e nable
Ġ[ '
' ]
Ġ2 99
81 7
ct ive
Ġ2 85
56 0
Ġ5 00000000
Ġ2 93
58 2
0000000000000000 0000000000
e ca
55 0
change Fee
Ġchange Fee
ba e
x ed
Ġ4 85
ba t
Ġ2 68
a ed
Ġ2 00000000000
5 99
5 85
1 01
fe c
8 18
Da y
3 15
S e
C ON
7 61
ff a
54 0
Ġ2 88
ch e
black list
ana ger
8 94
000000000 1
Ġ4 0000
Ma x
Ġ21 6
Ġ2 00000000000000000
Ġ order
Ġ9 000000000
Ġ4 95
61 00
Ġ2 74
T ake
D ate
0 74
fa b
Ġ21 2
With Re
55 7
Ġ2 09
s Addr
Ma ke
ba d
Ġ2 91
Ġ lock
Ġ2 43
Multi ple
000 2
Ġ3 03
Ġ28 000000000
gist er
ba te
Re bate
fe a
B U
Ġ41 000000000
58 7
Level sAddr
6000 526
fe re
85 0
xca b
258 01
n ap
8 35
a cti
08 05
Ġ3 75
Ġ7 73
D istribu
ar get
7 23
dc d
Ġre lease
fere nce
4 92
xe b
858 183
WithRe ference
Ġ2 71
a ab
re lease
1 21
8 03
f ed
Bu y
F a
d ca
ver n
Ġ25 5
C I
go vern
42 712
Ġ------ --
81 346
A r
x dee
25 21
41 9
ff b
fde ed
Ġ2 95
Ġ2 32
Ġe xecute
49 616
4 91
MA L
DE CI
DECI MAL
1 99
Ġ INITIAL
8 00
x fc
A ctive
5 64
xe fdeed
o de
visor s
6 65
m it
e x
Ġ2 94
Ġtransfer AndCall
Ġ5 00
Ġ2 27
49616 997
0 28
d ba
t a
b ee
a ea
fc baf
Ġ21 7
a ac
24 61
no min
8 14
0 92
f ba
54 9
6000526 01
l y
1 36
fb d
b da
185 85
ge ne
ke ting
l o
Ġis Minter
3 74
is Minter
R A
Ġ2 78
b fa
ce a
an Upgrade
b ac
ad a
dd e
Ġ45 000000000
i rd
08 01
Ġ4 14
8 34
3 214
S T
66 68
f da
Ġf reeze
Ġ2 98
99 45
9 04
000000000 5
Ġ2 36
pl it
18585 733
dd f
eb c
3 01
de b
a ec
transfer AndCall
S I
75 71
Ġ2 42
I s
ird rop
Ġ------ -
a re
6 99
2 71
Ġ2 0000000000000000
e ac
u me
de f
000000000 4
9999 9999
9 28
vestor s
ra te
b dc
Ġ3 38
7 74
db c
Ġ3 04
751 039
0 75
9 61
Ġ4 64
Ġ25 8
9 23
3 63
4 45
Trans action
c fb
Ġ3 18
66 24
bd f
02 001
0 98
9 75
Ġ13 000000000
Ġ2 47
l isted
Ġ3 28
T y
Ty pe
c ff
O n
Ġ3 68
IC AP
Fill s
Ġ funding
0 71
1 78
in al
fc f
ma tion
de a
c bf
Auth ority
0000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000
Sig n
b fd
000000000 2
ed c
0 73
000 8
58 9
1 15
uth ority
33 18585733
000000000000000000000000000000000000000000000000000000000000 0
To ICAP
L IM
LIM IT
Ġ cap
Ġ18 000000000
g th
ba a
7 03
d ce
2 24
db e
90 91
5 95
L en
3 94
7 04
Ġpa rent
pa rent
bb b
9 74
Ġ2 46
0 78
7 99
7 73
xa ct
E xact
2 21
Ġ3 35
2 65
P RI
7 08
fe f
604 05
ea e
3 23
1 04
Ġ2 81
Ġ3 08
Len gth
Ġ3 0000
ad b
ad c
63 74
Ġ2 37
d fd
9 64
Ġ16 000000000
04 98
t ers
5 73
Ġ newOwner
ie s
04 36
Ġ4 23
b eb
p y
000000000000000000000000000000000000000000000000000000000000000 8
Co py
y er
cent i
7 06
Ġ26 000000000
B et
ee e
07 91
55 9
4 74
8 93
gen c
mer genc
test Copy
51 0
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
ed f
e dd
a ted
PRI CE
t u
Ġ2 20
Ġ14 000000000
Fa ctory
a ff
36 06
0000000000000000 000000000000000
ca d
Ġ3 91
gra nt
1 24
Ġ3 48
x de
5 63
66 00
O r
Ġ52 000000000
2 08
51 9
1 91
1 94
494 6
2 95
Ġ latestRound
to m
56 9
43 0
Ġ3 21
4 98
centi vis
Ġ3 14
c dd
'] }),
tu rn
rozen Account
c fe
Ġ3 74
63 99
aa e
c ce
6 08
ee a
b dd
Ġwithdraw Funds
withdraw Funds
Ġ31 000000000
1 03
0000000000000000000000000000000000000000000000000000000000000000 000000000000000000000000000000000000000000000000000000000000
Fund Address
Ġ3 45
a fa
5 02
pending Owner
6 68
Ġ3 00
c fa
Ġ4 99
Start Block
Ġ8 0000000000
ec f
All owed
Ġ6 95
x dd
46 9
Ġ2 84
53 0
db f
Ġ25 2
tom ic
Ġ3 95
Ġ55 000000000
tomic Match
Ġ3 31
7 28
i ring
Ġ9 0000000000
Ġ2 29
fir m
C laim
Receive d
0 97
Ġ3 55
Ġ25 4
N ew
End Block
b ef
a de
Ġ3 73
a eb
token Creation
Ġtoken Creation
Ġ25 3
b ea
Ġ3 24
7 78
58 0
bb d
Current Price
Allocated To
n jinTeam
centivis ation
iti al
000 5
Ġ36 000000000
1 74
8 72
ves ted
3 45
Ġ update
Ġ2 66
1 65
1 14
Ġp ush
0 95
Ġ3 63
M ode
7 24
88 9
Ġ21 9
Ġ4 86
Ġ4 68
Ġ5 00000000000000000
bc f
Ġ2 39
43 9
5 7600080
Sig ner
1 97
pl ace
que st
bc b
Ġ3 65
95 65
f ce
ance ll
ab b
Ġ h
600052601 5600
3 28
72 76
DE L
Re lease
a fd
8 44
U N
22 06
2 28
6 93
Ġ27 000000000
ne ctor
2 63
41 0
21 98
Ġ kill
3 99
xf d
4 35
v ate
da a
cb e
72 74
8 71
1 713
7 71
eb d
7 25
3 78
Ġ25 1
Re leaseAgent
88 0
86 9
Ġ4 11
Ġ3 99
91 505
5 75
Ġ4 71
8 98
dc f
Transfer Agent
e fc
00 16
uth ori
7 01
Ġ7 78
Ġswap Exact
6 75
Ġget Timestamp
5 68
ra tion
Ġ94 813
transfer Admin
Ġtransfer Admin
1 02
3 18
Ġ42 000000000
Ġ32 000000000
6 94
1 25
9 02
p ush
05 55
R an
get Timestamp
6 27
Ġ4 35
Ġset BaseURI
81 0
3 21
de scription
A D
5 08
Ġde scription
C O
set BaseURI
2 25
Ġ3 25
e fe
pa y
M anager
Ġ4 18
d fa
Ġ3 23
Ġremove Access
remove Access
Ġ2 62
ba tch
Ġ33 000000000
S ub
7 75
8 01
9 73
Ġ3 78
Exchange Rate
3 03
8 61
ancell ed
Ġ4 75
Ġ3 0000000000000000
4 34
5 98
f ca
8 48
ac d
9 63
ce b
9 25
Ġ3 11
nt i
Ġ23 000000000
2 94
Ġ team
cc b
Ġ ma
ra y
c de
7 93
Ġtoken OfOwnerByIndex
5 33
5 91
8 33
ic i
or mation
dc c
o re
Ġ4 94
3 96
Inf ormation
19 08
To Whitelist
ab f
e ff
Ġ3 71
re ed
3 08
d fb
Ġ validator
xd a
Ġ3 64
min imum
F inal
hite list
ac c
cc c
1526 0200
Ġ2 76
Ġ84 000
8 04
P O
bb f
0 25
6 98
1 05
2 73
e de
6 03
2 09
Ġf inalize
a fb
1 33
5 01
Ġ2 49
74 64
Ar ray
6 218
bb c
G en
0000000000000000000000000000000000000000000000000000000000000000 000000000
3 61
4 00
A n
Ġse ll
V ersion
ĠT O
8 21
CON T
Ġ5 21
4 15
a ef
5 61
2 98
f or
00000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000
token OfOwnerByIndex
d fc
G A
Ġ4 33
ab c
Ġ onTokenTransfer
b fe
5 04
Sh are
4 96
ea ec
T AL
ac f
ee b
7 05
S nap
1 75
a ad
d fe
4 95
g u
5 28
Ġ3 61
Ġtoken ByIndex
token ByIndex
0 23
8 32
2 68
ce e
6 74
6 96
h ase
75 0000000000000
cc f
1 38
6 28
9 71
me ters
505 0505
1 08
Ġ4 91
ac count
f ad
e fa
vi ty
Para meters
3 91
M E
Ġ4 01
Ġ4 05
Ġ4 21
ri ce
Ġre voke
An yERC
9 000000000000000000000000
re voke
Ġ2 67
5 48
b ca
acti vity
Ġ2 72
3 25
Token Information
Pa used
b ba
Ġ3 94
Ġ7 0000000000
5 14
21 73
Release Period
activity ReleasePeriod
3 68
2 75
28 78
86 991
6 64
IC O
Ġ5 0000000
8 65
8 74
Ġ2 30
Ġ5 04
d ad
xc c
Ġ3 34
us er
000 4
Ġ4 28
Ġmin imum
Ġ2 69
Pre sale
Of fer
ce d
Ġ2 92
3 04
2 01
8 23
gene rate
tocolFee Recipient
set Validator
Ġset Validator
2 91
6 78
ec b
3 00
Ġ8 94
0000000 1
Ġ4 08
I m
2 99
8 24
2 64
ee f
5 76
Ġ3 93
Ġ4 15
024 6668
da ta
4 28
reation Block
Ġ3 98
Ġ4 48
ac a
4 99
61 02
F rozen
U M
ec d
generate Tokens
Ġ4 00000
2 04
4 48
7 76
000000000000000000000000000000000000000000000000000000000000000 6
Ġ4 62
Ġ disable
9 78
Ġ21 0
Ġ hash
Multi Sig
Ġ4 03
b ff
1 34
3 64
ver t
9 06
con troller
Ġ2 77
25 0000000
07 95
3 77
f inalize
igra te
63 00
ab d
Ġ3 02
456 05
Ġc ancelOrder
24 24
ult is
S wap
00 18
6 21
2 61
Ġ t
03 90
Ġcon troller
2 74
ee c
00000000000000000000000000000000 00000000
65 21
000000000000000000000000000000000000000000000000 0
C rowdsale
5 38
s h
4 23
9 66
Ġ2 97
Ġ4 25
9 07
re ward
c bd
eb f
dc b
Co m
Ġ4 98
e th
0 65
Ġ5 15
0000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000000000
Ġ trade
Ġ4 24
ar ded
Ġ4 12
4 64
Ġf lush
6 91
Ġs ale
Ġ4 662
7 98
Ġ15 0000000000
7 97
2 93
3 95
dd a
Ġp re
Ġ45 652
8 45
578 94
5 35
m ain
8 78
77 77
6 71
R o
Transfer Proxy
8 02
5 45
Re turn
govern ance
7 68
xc b
ec c
SI S
Ġ5 99
Ġ7 28
e ba
ProtocolFee Recipient
4 62
c fc
4 24
PO INT
S iring
xchange Token
Ġ2 40
change Minimum
Ġchange Minimum
d Orders
Call data
IN VER
BA SIS
Or Finalized
ancelled OrFinalized
INVER SE
Ġ validateOrder
To Sign
code name
at ic
Re place
Match Price
orders CanMatch
Final Price
Array Replace
gu arded
Calldata CanMatch
atic Call
guarded ArrayReplace
fb ee
3 06
a ba
a fc
AL L
Balance Of
C AP
i ff
5 62
Ġ17 632
b fc
re ase
3 93
Ġ5 05
Ġ1 256
8 22
74 68
c df
Ġ18 38
25 0000000000000
ca ba
4 71
6 61
ed b
Sh ot
1 70
8 99
ca a
Ġ19 000000000
Ġ53 000
Snap Shot
SnapShot Block
Ġ4 04
4 75
e fd
Ġ6 00000
4 73
one Token
da e
0 93
M et
449 022
72 7823
Ġ5 85
O L
Cl oneToken
Ro ot
Ġ63 000
Ġ3 06
1 71
3 75
3 71
6624 727823
Ġ4662 729
Ġ17632 6624727823
Ġ176326624727823 352
7 63
1 23
Ġ5 08
8 92
Per cent
0 64
is wap
4 93
4 25
5 74
72 68
61 03
i co
Period s
6 25
5 24
75 0000000
b fb
S top
ea f
se ll
5 06
02 08
Ġ3 44
9 09
00 41
1 35
6 23
1 63
Ġ move
Un vested
03 03
Cl iff
Period Amount
Period Length
Periods Number
c fd
ol lect
92 91
8 90
E GA
old Tokens
TE C
DEL EGA
TEC ALL
DELEGA TECALL
9945 97
trans ferable
Ġ4 38
Ġd istribu
e aa
206 994597
2206 206994597
4 05
Ġ6 04
Ġ4 78
Ġ17 000000000
Ġremove Minter
remove Minter
5 21
Ġ3 58
4 68
it ty
Im plementation
DECIMAL S
0000000000000000000000000000000000000000000000000000000000000001 0000000000000000000000000000000000000000000000000000000000000001
7 65
Ġ4 44
2 78
4 90
75 39
For ward
all ow
161 24
Ġ22 0436
3 98
c bc
c ancelOrder
8 91
5 94
Ġ29 000000000
1 98
s pender
Ġs pender
Ġ4 74
5 03
624 96
Ġ chi
1 76
4 18
se nd
f lush
8 75
Proxy Ownership
Ġ5 91
d ow
Ġmint Tokens
claim Token
a ge
Fee s
Forward er
Ġ25 200
xe f
63 47
mint Tokens
99 94
Ġ4 45
Ġ4 66
d istribu
Ġ5 00000000000
Ġ5 03
4 78
2 96
78 03
2 76
Ġ last
Ġ timeout
Ġpay mentAmount
00000000000000000000000000000000000000000000000000000000000000 3
pay mentAmount
Ġ5 35
6 06
Ġ2 96
000 3
a vailableFunds
o racleCount
Ġa vailableFunds
Ġo racleCount
0000 1
48 38
c db
st andard
Ġst andard
Ġ4 55
Ġ4 87
ir th
9 76
5 34
06 01
5 44
White listed
Ġm ulti
S end
ar y
Ġ5 18
Ġre fund
LO C
1 90
Ġ35 000
6 73
P hase
3 90
D ata
Ġ4 00
Ġ4 73
Ġ2 79
Ġ3 13
0 96
Ġ3 51
Con tribu
Ġ4 93
Ġ5 000000000000000
2 72
Ġ3 41
7571 336
claim Tokens
r keting
ad ata
1 64
4 70
Ġre ward
Ġ65 000
stop ped
Ġstop ped
5 88
6 05
Ġ5 28
xb bc
Ġe th
U ns
B irth
7 000000000000000000000000
5 31
ef ici
72 65
xb e
efici ary
99 65
Ġ3 22
Ġ5 25
5 16
total Upgraded
Ġtotal Upgraded
P la
08 08
4 63
8 63
3 11
M ul
Ġ14 00000000
Trans ferable
Ġ3 54
upgrade Master
Ġupgrade Master
Ġe nd
Ġ3 16
set UpgradeMaster
Ġset UpgradeMaster
f it
Ġ3 96
Ġst ake
8 85
5 66
8 68
Ġ4 16
upgrade Agent
Ġa cti
Ġupgrade Agent
Ġmint er
mint er
Ġ94 0000
set UpgradeAgent
Ġset UpgradeAgent
inc rease
re fund
75 78
Pro pos
5 84
0000000 2
8 06
Ġ5 34
6 76
282 61
get UpgradeState
Ġget UpgradeState
1 22
Balance s
Ġ5 14
2 66
Ġ2 60
09 010
6 22
end ing
Ġ5 55
Ġ34 000000000
5 25
e i
Ġ advisers
M ar
Ġ community
7 02
7 96
000000000 3
fa ult
t ri
o Address
61 05
Start Time
8 95
xy Owner
8 39
Ġ66 000000000
Ġin itialize
ve st
Ġ3 36
C allback
Tokens For
Ġ3 32
000000000000000000000000 1
Ġun lock
5 93
ĠTO KEN
8 79
re as
Ġ3 26
V ol
Ġ3 12
Ġ3 52
Vol ume
6 77
un lock
Ġ48 000000000
Con version
Ġa vailable
16 000
Ġc ollect
uthori ze
5 79
iswap V
P ending
Ġ44 000000000
Pro fit
8 11
Ġ38 000000000
Per Eth
TO TAL
060405 18
o verdraft
Ġo verdraft
u la
63 63
47 93
Fill ed
k le
0 77
comm it
A R
015 26
eeeeeeeeeeeeeeee eeeeeeeeeeeeeeee
03 000000000
kle Root
0000000000000000 00000000000000
Ġset Name
Ġ5 23
e mit
test Trade
64 67
ca tion
5 11
Ġclaim Tokens
Ġ locked
Ġchange Owner
change Owner
Ġ n
65 65
Ġ5 24
mount Filled
4 33
515 8
Ġ54 000000000
Met adata
P l
256 5
4 36
8 64
ultis ig
75 65
000000000000000000000000000000000000000000000000000000000000006 000000000000000000000000000000000000000000000000000000000000000
Ġ65 000000000
in itialize
33 33
Ġre gister
In vestor
tri eve
Ġ3 53
Ġ4 84
73 16
AD D
il y
a vailable
Ġ5 61
14 61
0000000000000000000000000000000000000000000000000000000000000002 000000000000000000000000
Ġ4 34
Ġ3 07
08 28
Ġ bat
Ġre gistry
Ġ5 63
AL E
97 94
Ġo perator
2 92
re gistry
eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeee
e nti
90 61
col lect
Ġtransfer sEnabled
transfer sEnabled
06 04
0791 47
o perator
set Name
Ġ5 11
is tra
Ġ167 28261
Ġ773 6399
079147 0801
Ġ16728261 0791470801
Ġ1 000000000000000
0000000000000000000000000000000000000000000000000000000000000000 0000000000
RES S
] )
] )':
Ġ1 001
ex t
5 72
o use
Ġ6 05
Operator s
ch ase
set Minter
Ġset Minter
Time locked
on ERC
8 145
73 03
Ġ39 000000000
Ġs plit
1 96
3 02
0000000000000000000000000000000000000000000000000000000000000000 2
61 000
rketing Wallet
Ġ5 64
09 05
Ġ6 24
2 77
78 65
e xecute
6 92
Ad visors
Ġwithdraw Token
Ġ2 70
6 611
15 65
25 33
ADD RESS
16 00160
T arget
Ġ5 38
st ake
S afe
Auth enti
Authenti cation
B id
Ġ5 94
Ġ2 001
Ġ6 23
ir st
Ġ1 0000000
1 26
a tor
4 06
D ra
4 22
Ġ25 7
Ġ5 33
Ġ4 31
08 0000000000
C re
Mint Agent
6 72
Account LevelsAddr
account LevelsAddr
8 36
RI BU
Ġ6 08
18 82
64 01
Ġ37 000000000
RIBU TION
Ġe x
Ġ4 32
Ġ5 65
max Supply
ToICAP WithReference
Ġ4 13
Ġun iswapV
E x
ig ner
on us
1 92
31 04
000000000000000000000000 4
Ġ ad
N once
ur y
CONT RIBUTION
reas ury
Ġ3 17
00 36
02 27
re leased
7 72
Ġ3 00000000000
21 87
Ġ3 43
0 72
Ġ3 19
Ġre leased
Ġ7 23
000000000000000000000000000000000000000000000000000000000000 02
4 11
1 06
00000000000000000000000000000000 00
7 07
bl ic
Ġ3 00000000000000000
6 26
4 02
Ġ4 22
99 04
05 000
4 16
Address es
4 31
Ġdeposit Token
25 25
77 78
withdraw Token
Ġ18 0000
Ġ2 000000000000000
98 61
ĠbalanceOf At
u ration
1 32
Ġ4 41
3 92
Ġ5 45
G EN
balanceOf At
N ext
5 18
97 91
Ġ2 90
Ġ4 92
Ġ3 27
Ġ4 42
Ġ11 99
DA O
V es
02 000
uthorize Operator
Ves ted
7 92
Ġ3 72
66 000
Ġ6 01
Grant s
Ġ4 54
o f
2 97
gra n
Ġa tomicMatch
6 09
Ġ5 59
02 05
ula rity
gran ularity
Ġ6 21
Price s
2 07
8 26
65 72
ĠtotalSupply At
00000000000000000000000000000000 0000
Siring Auction
5 67
totalSupply At
01 01
A l
Ġ4 58
Ġ8 95
da y
09 24
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000
Ġ46 000000000
Ġ4 81
6374 342
Ġ3 46
Ġ3 76
Ġ3 37
6611 7276
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
Ġ61 000000000
4 77
To talSupply
Ġ63 000000000
91 93
71 63
Ġ6 75
Ġ3 29
Ġ25 9
15 45
Ġ7 74
4 79
re gister
Ġ2 000000000000000000
Ġ4 67
6 97
c anUpgrade
Ġc anUpgrade
Ġ3 92
791 2
21 000
5 07
B reed
90 71
95 70
08 11
Ġ6 93
Ġ4 0000000000000000
0 76
Ġ6 99
ĠswapExact TokensFor
9999 99
5 13
Ġ4 06
8 16
80 95
1 31
Swap Callback
Ġ6 74
Ġ84 000000000
Trade able
R N
24 58
freeze Account
63 65
Ġ5 86
BU RN
Ran k
l i
batch Transfer
O pen
3 66
Contribu ted
26 00
09 21
Propos al
Pl an
Ġwithdraw Tokens
deposit Token
Ġ5 44
61 74
8 09
1 66
64 23
78 063
withdraw Tokens
Plan et
Ġ4 02
72 00
04 31
Ġmax Supply
5 96
Ġ5 13
3 79
ig n
Ġ28 2
600 160
4 000000000000000000000000
Ġ5 66
Con nector
01 61
252 00
t ies
qui re
5 92
Ġ4 51
Ġ6 98
block Account
Ġ5 71
C h
000000000000000000000000000000000000000000000000 001
64 64
Ġ3 56
Ġ53 000000000
4 66
Ġ75 000000000
76 00
O ut
Ġ6 25
09 25
Ġ3 47
16 73
D U
8 66
4 97
81 04
5 32
00 14
Ġ13 75
01 03
8 000000000000000000000000
15 15
6 20
38 38
ser ve
pending Admin
Ġ3 97
1 79
68 71
Ġ72 000000000
Reser ve
xy Type
3 76
5 27
4 26
Ġ6 68
45 49
Ġ3 67
Ġorder Fills
Ġ3 42
RA TION
DU RATION
82 98
Ġ28 6
Ġ5 98
I D
8 30
Ġ5 48
68 465
Token Exchange
order Fills
0000000000000000 000000000000
Ġ3 09
0000000000000000000000000000000 1
Ġ4 60
Ġset Authority
date Main
Migration Phase
Date Main
quest TokenExchange
set Authority
00000000000000000000000000000000000000000000000000000000 64
3 97
W ei
4 76
Ġ15 0000000000000000
000000000000000000000000000000000000000000000000000000000000000 5
Ġ5 78
Ġ12 03
7 90
73 35
Ġ94 795
Ġ6 61
ar ted
ffffffffffffffffffffffffffffffff ffffffffffffffffffffffffffffffff
64 759
6101 000
Ġ55 000
5 22
Ġ691 63
S ymbol
Ġ6 94
06 02
01 91
Ġa uthority
a uthority
60405 18
call back
Auth ori
5 29
091 0390
73 05
95 23
ily Limit
4 07
M e
Ġ5 12
Ġ3 66
Ġ13 68
03 05
fee Account
Ġfee Account
45 77
3 000000000000000000000000
Dra in
76 04
4 27
Ġ5 73
Ġ5 54
8 96
cca d
Ġ3 57
11 63
09 71
29 05
de ac
mergenc yERC
Ġ11 98
d i
Al er
00000000000000000000000000000000 0000000000
Ġ56 000000000
enable Transfers
78 87
26 08
Ġenable Transfers
25 000
73 68
0000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000001
25 08
33 63
an t
25 0000000000
72 24
Ġ3 10
Ġ3 20
Ġ3 62
Ġ5 74
Ġ4 43
Ġ49 000000000
96 000
N A
Ġ7 93
1 251
Ġ contract
07 93
Ġo pen
U ser
allow Transfers
25 26
Ġ6 03
54 93
Ġ11 64
a k
00 11
er ly
erly ing
8 29
Ġ58 000000000
nomin ate
Ġ174 54
Ġ5 68
000000000 6
Ġ25 0000000000000000
Ġ5 88
in ation
Ġis Token
7 09
63 54
I ssue
is Token
24 78
Ġ5 93
Ġ9 25
Ġ333 333
75 0000000000
5 12
o pen
8 62
Ġ5 07
che ck
75 74
000000000000000000000000 7
for ward
Ġ5 22
New Owner
st ination
Ġ testCopy
73 73
28 23
72 000
Pla yer
21 18
vi de
Distribu tion
8 37
700 6
Ġ66 66
Ġ4 26
34 46
Ġ17 99
vali d
Ġ4 17
Vested Tokens
1 72
8 07
l f
1 27
RE A
25 88
61 65
Ġ71 000000000
Ġ grant
Ġ3 69
Issue d
24 63
75 73
D is
01 000
UN IT
Ġ25 0
Ġ28 3
51 29
m ulti
Ġ4 96
6 29
00 48
24 88
601 36
1 29
nomin ated
nominate NewOwner
nominated Owner
68 83
Account Is
20 24
8 27
28 0000000000
Ġ12 28
91 23
Uns oldTokens
Ġ pendingOwner
75 000
03 16
Ġ6 64
Q ui
Qui ck
00 45
NA ME
G ame
Ġ12 0000000000000000
vide nd
305 6
B en
i f
Ġ6 65
167 68465
Ġ1838 4838
Ġ17454 16768465
Ġ1745416768465 60136
Ġ2 00000000
P ool
Ġ3 49
Ġ57 000000000
b aseURI
Ġb aseURI
Ġ4 72
Ġ4 07
Ġ99 9
2 00000000
71 000
LOC K
Ben eficiary
Sale Auction
rom o
23 88
61 04
11 11
Ġ5 95
rowd FundAddress
23 78
8 67
f rozenAccount
000000000000000000000000 000
visor Tokens
Ġ64 000000000
905 3
xb dd
00 83
Presale Supply
v Wallet
25 14
04 48
8 70
0 25200
Ġ22 00000000
5 90
000000000 7
31 18
Ġ7 65
78 55
Ġ15 37
Ġ11 0000000000
Ġ43 000000000
leaseA d
h al
63 36
04 08
000000000000000000000000 6
Ġ6 22
visors Allocation
po se
visor Address
E njinTeam
in centivisation
To Allocation
Ġ11 94
Ġe njinTeam
total AllocatedTo
Ġtotal AllocatedTo
EN J
Ġin centivisation
en jinTeam
Crowdsale Allocation
trieve UnsoldTokens
leaseAd visorTokens
EnjinTeam Tokens
Ġ7 95
M ultisig
pe nt
Ġ5 75
92 000
Ġset Admin
98 00
Ġ7 05
set Admin
Ġc urrent
Ġ62 000000000
main ing
24 18
cu r
63 73
Ġ501 1882
7274 4793
Ġ6666 72744793
Ġ666672744793 7912
Ġ4 83
Ġf rozenAccount
Ġ co
0000000000000000 0000
25 00
er t
Ġ6 71
74 65
74 55
Ġ5 06
End Time
mergenc y
Ġ3 30
Ġ3 000000000000000
28 000
08 38
Ġfreeze Account
1 77
m igration
59 09
78 20
Ġm igration
61 45
xd fe
lo se
cur rent
1 20
in dow
28 28
23 48
72 0000000000
Ġ6 73
To day
8 20
24 20
07 000
5 09
Ġ5 84
CO R
5 36
Ġ25 0000000000
Ġ121 000
64 0000000000
000000000000000000000000000000000000000000000000 01
Ġ7 04
ur chase
co ver
ea r
Ġ5 16
St arted
pent Today
R O
Ġ13 95
Cre ated
08 94
Re quire
Withdraw al
64 65
79 05
25 75
Ġrelease TokenTransfer
1 644
2 90
Ġis Operator
release TokenTransfer
Ġ9 68
xe be
Ġ5 53
qui red
09 08
o ts
68 0000000000
Created Count
S Y
21 03
Ġ15 95
64 56
63 35
Ġ6 78
ef ore
Ġ67 000000000
funding StartBlock
Ġfunding StartBlock
Ġ8 18
34 95
Ġre leaseAgent
re leaseAgent
set ReleaseAgent
Ġset ReleaseAgent
Ġ13 03
ve red
co vered
Ġ94 000000
12 73
Ġ tra
Ġ28 7
transfer Agents
23 93
Ġtransfer Agents
set TransferAgent
Ġset TransferAgent
61 13
76 64
49 02
Ġ88 000000000
Ġ95 000
55 205
635 92
77 73
78 0000000000
Ġ15 03
66 66
76 0000000000
xb fa
1 07
Ġ7 75
91 63
6 90
8 97
xf ca
claim Ether
d o
Require ment
22 28
Ġ12 00
Ġ6 28
1 681
Ġp rice
Ġ7 99
578 063
M B
xa dd
Ġ25 000
838 119
SY MB
SYMB OL
3 07
Ġ3 39
98 63
claim Ownership
72 64
Mar keting
x fff
34 38
Ġclaim Ownership
Ġ6 00
00000000000000000000000000000000000000000000000000000000000000 22
Ġ7 01
Ġ49 73
25 94
Ġ47 000000000
O S
Ġ5 02
68 74
Ġ99 244
B efore
5 77
23 03
Ġ12 78
Ġchange Controller
Ġ8 14
change Controller
21 71
Contract Address
B onus
Ġ5 17
77 000
fcc ce
74 43
000000000000000000000000 3
00000000000000000000000000000000000000000000000000000000 65
828 03
e st
Ġ4 76
Claim ed
funding EndBlock
Ġfunding EndBlock
Se ll
irst Day
Index To
75 33
Ġw hitelist
fault Operators
ss et
78 000
s Per
Ġ blacklist
68 000
01 35
98 000
Ġ7 64
Ġ4 89
cc bd
s De
4 67
61 73
09 000
Ġ108 000000000
01 96
23 33
23 45
S weep
71 25
26 000
Ġ2001 000000
74 75
98 0000000000
Ġ22 000
78 08
96 05
s plit
ss ert
28 15
8 77
Ġ12 04
und erlying
4 32
09 00
all oca
92 0000000000
87 6347
18 88
con d
u re
ns ity
Ġget Dis
Planet sDe
covered PlanetsDe
ĠgetDis coveredPlanetsDe
ĠgetDiscoveredPlanetsDe nsity
74 010
Black list
09 64
65 53
98 91
Authori zed
Ġ8 03
65 000
Ġ4 27
75 143
06 08
73 61
93 000
00000000000000000000000000000000000000000000000000000000000000 12
ca rd
23 08
61 247
Ġ11 63
21 0000000000
65 68
54 48
Co in
61 145
73 48
Ġ13 0000000000
93 85
Ġ45 6521
96 0000000000
Ġ6 63
Ġset Fee
25 24
Ġ4 56
set Fee
25 03
76 01
sh ot
9 77
itiali zed
Ġ75 000
05 00
74 0000000000
w hitelist
Ġ4 36
S c
Ġ4 97
Ġ11 18
28 48
72 95
11 08
r t
Ġ5 43
Ġ7 03
74 000
62 000
Ġ5 19
5 97
36 913
ad bc
Ġ3 59
04 000
tokenCreation Min
ĠtokenCreation Min
Ġ new
Ġ5 51
Distribu ted
Ġ4 53
Ġ7 25
61 08
63 23
24 15
65 73
61 951
For Marketing
21 94
21 88
Ġ8 15
28 05
63 75
Set ter
Ġ11 68
96 25
Ġsend MultiSig
28 18
01 84
Ġ12 71
xdc df
A vailable
tokenCreation Cap
ĠtokenCreation Cap
Ġ13 08
Ġ7 98
Ġ558 0000000000000
02 03
ce bbe
34 08
Ġ14 95
Ġ8 98
25 85
64 35
99 0000000000
Ġ4 57
23 07
1 09
Ġ4 46
Ġ g
Ġ15 93
66 63
Ġ8 05
00000000000000000000000000000000000000000000000000000000000000 16
76 24
transfer AnyERC
Ġtransfer AnyERC
Ġ3 40
Ġ5 31
Ġ5 83
Ġ4 77
07 68
00 15
Ġh al
N COR
BA NCOR
8 1526
76 05
01 38
28 35
Ġ28 9
48 00
In activityReleasePeriod
te m
76 08
validate Orders
Active Transaction
valid Order
validateOrders Before
Ġ5 62
921 36913
Com m
68 03
Ġ14 74
locked Tokens
Ġ10 78
75 18
72 73
00000000000000000000000000000000000000000000000000000000000000 14
x ies
Ġ3 60
Ġ69 000000000
L o
09 0000000000
083 038
76 03
Ġ8 35
24 0000000000
00000000000000000000000000000000000000000000000000000000 63
24 33
Ġ59 000000000
Pa y
Ġ12 21
91 90
Ġ6 0000000000000000
94 2461
xaa cebbe
Q u
63 45
24 000
Ġ15 99
Ġ105 000000000
set TokenInformation
Ġset TokenInformation
pro tocolFeeRecipient
Ġpro tocolFeeRecipient
Re maining
021 29
increase Nonce
07 99
firm ed
Comm unity
71 85
75 75
Au to
Stop Receive
5 70
61 63
21 05
02 0000000000
Ġ68 000000000
09 65
Ġ3 50
099 843
Con firmed
21 68
76 63
97 000
Ġ13 28
Ġc an
64 41
74 00
Ġ13 04
Ġ4 47
Ġ generateTokens
73 45
Ġ45 000
c reationBlock
71 33
Ġc reationBlock
Ġ4 944
Ġ4 82
997 984
Ġ11 65
govern or
4 20
ak ing
Ġ96 000000000
07 00
Ġ115 33
igra ted
73 000
74 35
2424 32
73 00
742 61145
838 250
xbdd ccd
u a
90 78
24 95
63 000
74 03
Ġ []
73 93
997984 745
3 70
23 94
23 11
07 71
91 68
Ġdestroy Tokens
destroy Tokens
M IN
Ġ90000 000
77 95
Ġ11 28
In vestors
xea fb
64 000
000000000000000000000000 2
Pa use
e fdf
02 2300
97 04
3 09
Z ER
68 55
ZER OS
96 03
C REA
Ġ8 0000000000000000
Ġ10 65
01 2300
76 75
01 52
23 28
yPa th
72 75
Ġ7 08
000000000000000000000000000000000000000000000000000000000000 1
8104 250
022300 91
012300 72
Ġ13 65
V a
79 03
Ġ99 000000000
Ġ73 000000000
Ġ81 000000000
0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 000000
74 84
n um
Ġ4 19
Ġ7 91
95 35
04 04
61 64
74 05
U se
01 85
76 93
34 764
Ġ8 93
23 69
71 0000000000
Ġ28 0
Ġ7 68
Ġ132 000000000
Ġ39 000
Ġ15 000000000000000
97 0000000000
Ġ7 71
Ġ5 41
01 0000000000
76 65
Ġc ancel
Ġ14 05
000000000000000000000000000000000000000000000000000000000000000 7
8 140
Ġ8 38
75 85
75 00
95 0000000000
23 15
01 00
a calltrace
23 86
Ġ8 33
23 0000000000
91 794
72 28
or k
Bu yPath
Ġis Finalized
Ġ10 24
2 993
90 93
21 99
is Finalized
96 00
F un
02 04
Ġ38 5
A N
Ġ onERC
CREA TION
token TransferProxy
Ġtoken TransferProxy
96 74
p rice
Ġ4 59
64 55
96 94
Ġ9 75
cond sPer
Ġ governance
23 04
4 29
96 08
ie nce
vidend s
Ġa irdrop
Ġun freeze
un freeze
Ġ4 29
change ProtocolFeeRecipient
Ġchange ProtocolFeeRecipient
IN G
Ġcalculate CurrentPrice
calculate CurrentPrice
71 38
e xchangeToken
01 55
28 00
Ġe xchangeToken
n ant
24 04
a irdrop
03 47
77 0000000000
Ġ11 91
c ancelledOrFinalized
Ġ INVERSE
96 65
approve dOrders
Ġapprove Order
Ġapprove dOrders
Ġc ancelledOrFinalized
158 01561
a tomicMatch
Ġ codename
Ġ ordersCanMatch
Ġ guardedArrayReplace
71 52
approve Order
Ġ11 00000000
st aticCall
Ġst aticCall
order CalldataCanMatch
hash Order
hash ToSign
validateOrder Parameters
Ġcalculate MatchPrice
Ġcalculate FinalPrice
calculate MatchPrice
calculate FinalPrice
Ġorder CalldataCanMatch
minimum MakerProtocolFee
minimum TakerProtocolFee
Ġminimum MakerProtocolFee
Ġminimum TakerProtocolFee
Ġhash Order
Ġhash ToSign
changeMinimum MakerProtocolFee
changeMinimum TakerProtocolFee
ĠchangeMinimum MakerProtocolFee
ĠchangeMinimum TakerProtocolFee
ĠvalidateOrder Parameters
7 048
Ġ91 000000000
02 25
condsPer Block
71 36
61 35
07 74
Ġ11 74
905 9
Ġ85 000000000
24 35
73 95
99 33
token Factory
Ġtoken Factory
4 09
g nant
92 93
Ġ74 000000000
06 0000000000
Ġ5 37
75 27
itial Supply
90 63
34 18
Ġ77 000000000
21 85
000000000000000000000000 8
Ġ233 00
28 38
Ġ141 0000000
Sc ience
73 0000000000
23 95
Ġ latest
72 04
Ġ166 666
Birth Fee
Ġ22 050
68 38
Ġ8 64
07 03
Ġ4 30
92 64
46 00160
Ġm igrate
00 55
Ġget Balance
8 247
Ġparent Token
parent Token
que nce
07 97
0000000000000000000000000000000000000000000000000000000000000000 0
D rop
Ġ5 67
01 15
Ġ14 0000
Token Balance
0000000000000000000000000000000000000000000000000000000000000001 0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
ETH For
Ġparent SnapShotBlock
parent SnapShotBlock
Ġ12 64
181 6467
Se quence
xc ba
23 05
96 04
Ġ7 94
Ġ111 000000000
Ġ13 05
75 94
06 91
72 036
97 05
98 53
Ġcreate CloneToken
create CloneToken
25 57
m igrate
23 61
5 312
68 48
06 0200
Ġ13 73
Ġ15 01
980 7539
Sup por
92 01
Ġ7 00
6 000000000000000000000000
1908 19
74 38
Ġ4 10
Ġ13 01
99 9053
28 08
Ġ45 038
96 99
77 00
V E
75 05
76 94
Ġ104 000000000
Ġ5 32
Ġ5 52
Ġ8 55
Ġ7 24
igner s
Ġ17 9565
02 01
ound er
Ġ8 08
92 08
29 07
Ġmint ers
Ġ8 04
Migration Info
02 23
i z
TOKEN S
0795 34764
Ġ4973 908
Ġ179565 079534764
Ġ179565079534764 25
f bab
95 000
mint ers
Ġ15 14
61 33
63 38
68 18
99 46
Ġenable Trading
D uration
24 08
74 45
07 0000000000
enable Trading
K itty
78 38
}) ],
fe ddc
09 03
78 48
21 93
21 27
Ġ8 01
Ġ5 57
92 71
21 77
Ġ8 28
Forwarder Tokens
68 00
98 54
Ġwithdraw Ether
68 35
Ġ12 65
DA TE
Ġ78 000000000
use DELEGATECALL
Use DELEGATECALL
xa eb
withdraw Ether
A sset
Ġ76 000000000
00 46
65 74
C a
Ġ transferable
c ancel
99 000
73 18
Ġ10 93
25 15
25 18
Ġ11 95
Ġ16 93
29 000
Ġ8 44
5 183
21 55
25 55
26 03
71 14
pl o
16 04
754 74
Ġ5 46
21 35
23 000
75 28
63 0000000000
Burn ed
06 03
Ġ18 65
25 35
77 05
77 64
Ġ14 08
25 84
000000000000000000000000000000000000000000000000000000000000008 000000000000000000000000000000000000000000000000000000000000000
23 35
Ġ183 1545
92 00
77 94
09 28
78 05
63 34
23 34
21 91
Ġ486 2187
91794 14
72036 9179414
Ġ1831545 720369179414
78 28
Ġcreate Tokens
Ġ has
61 14
99 98
61 44
21 64
Ġ14 14
transfer ProxyOwnership
63 03
Ġtransfer ProxyOwnership
73 22
61 0000000000
63 93
90 24
0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 000000000
k itty
71 55
Ġ16 95
61 28
1526 02001
Ġ4 49
Ġ15 18
Ġ19 65
118 34
Ca che
78 00
Ġ13 64
create Tokens
Ġ15 15
ore ign
f j
x ua
Ġw fj
663 95
iz xua
Ġwfj izxua
tion Finished
09 75
63 15
24 98
61 34
97 74
90 21
65 48
63 55
73 94
Ġ95 000000000
Ġ12 98
inish Distribution
Ġ8 85
Ġ14 38
Sale Contract
re claimToken
Ġ5 56
63 08
Ġre claimToken
Ġ4 52
02 93
kitty IndexTo
Ġ8 00
Ġ5 42
Ġ14 41
Gen e
92 04
75 98
96 93
Ġ14 44
P urchase
Ġ19 03
Ġ82 000000000
Ġ14 48
99 38
78 35
99 58
09 68
Ġ4 69
Ġ8 88
76 95
Ġ10 64
Ġ4 79
000000000000000000000000000000000000000000000000000000000000 012
w allet
61 25
06 05
4 952
45 76
74 48
21 14
Ġ17 05
xdc dc
08 03
ce eab
pl a
73 04
73 14
92 94
Ġ17 08
07 04
916 02
Ġ4 20
Ġ4 00000000000000000
23 38
Ġ14 64
02001 90
01 88
75 93
02 94
Ġ13 14
00000000000000000000000000000000 00000000000
63 33
Ġ18 94
000 7
Ġ5 81
90 64
Ġ10 95
8 0600
Ġ15 55
26 04
Ġ17 28
xfb ffd
Ġd o
Ġset Price
Ġ50 719
qui ck
814 11834
istra tor
2993 7268
8247 06
Ġ10 68
78 68
90 94
Sequence Id
25 95
71 65
Ġ14 04
0000000000000000 000000
73 91
23 14
98 15
73 88
78 84
Ġ7 21
i re
77 68
73 33
06 94
61 15
71 48
ca che
Ġ13 91
83 79
Ġ10 28
25 93
24 14
92 74
in vestors
71 88
000000000000000000000000000000000000000000000000 002
78 04
Ġ12 93
25 05
set Price
alloca te
F oreign
Ġ116 280
Foreign Tokens
0000 2
000000000 8
Ġ4 37
F O
71 18
Ġ5 20
AR T
5 855
Ġ13 99
831 04
25 44
73 65
14 89
Pending Version
Co st
75 55
Ġ11 01
5183 0227
61 85
Ġ97 000000000
Ġ10 91
Ġsafe Add
Ġsafe Sub
21 01
72 03
72 08
ir cula
24 23
21 33
78 33
DA Y
vate Safe
vateSafe Mode
Ġ P
98 44
safe Add
Aler ter
Ġ3 441
25 34
72 94
72 91
safe Sub
0041 0041
H ouse
Ġ92 000000000
Ġ10 23
21 38
Ġ8 45
CON VER
Next SequenceId
St ake
send MultiSig
ro und
Ġ8 91
Ġ12 01
Ġ16 65
TI ME
Ġ18 04
Ġ10 74
5 000
28 58
25 54
72 99
25 01
75 38
78 85
98 88
06 68
97 68
Ġ13 94
61 38
71 00
Ġ16 91
Ġget Address
75 64
Ġ8 48
98 95
nap shot
97 64
21 00
21 45
93 93
Ġsafe Mul
safe Mul
l ot
75 04
Ġ8 65
Ġ5 36
a ve
Ġ12 91
Ġ4 39
02 91
61 88
78 95
Ġ15 05
Ġ9 05
Ġ9 24
28 55
66 20
Ġ18 0000000000
00000000000000000000000000000000000000000000000000000000000000 5
21 48
Call er
Ġin vestors
96 64
token ExchangeRate
Ġtoken ExchangeRate
M igrated
eth FundDeposit
Ġeth FundDeposit
Ġ11 35
02 63
Ġ1537 781
Ġ13 18
890 94
73 44
d ge
Ġ1 0000
77 04
71 35
09 04
25 46
Ġ5 39
65 0000000000
95 84
Ġ13 93
Ġ125 000000000
Ran do
Rando m
c an
Ġ5 26
97 03
2 000
76 91
07 05
I R
72 61
97 00
Ġ11 03
or um
08 000
75 45
Ġ15 94
74 93
s ol
Ġ1 038
75 91
74 32
78 93
000000000000000000000000000000000000000000000000000000000000004 000000000000000000000000000000000000000000000000000000000000000
Ġ[] }),
up ply
72 05
rac li
racli ze
Ġ14 24
94 18
96 68
00000000000000000000000000000000000000000000000000000000000000 64
25 91
71 95
28 88
Ġ121 000000000
un ch
63 18
To Eth
Ġ12 95
78 58
ST ART
000000000 70
36 000
28 62
P u
74 15
Ġ8 24
25 56
3 981
64 34
73 85
000000000000000000000000 5
61 24
61 48
63 68
Ġ7 000000000000000
Ġ10 99
Ġ8 99
09 02
forward TransferFrom
06 23
ub t
Ġdo ubt
98 71
a is
re quired
66 04
00 32
07 64
Ġ17 91
Coin s
74 85
73 15
98 08
8 980
25 28
78 18
4952 71
ee deac
1 75474
77 91
Ġ9 03
Ġ2 000
61 18
76 23
63 85
Ġ16 03
74 04
Ġdistribu te
Ġ8 58
pro xyOwner
Ġpro xyOwner
71 03
71 91
63 43
A irdrop
Ġavailable Volume
De v
Ġ1 015
61 68
01 90
02 99
21 08
97 95
73 55
Ġ14 91
73 23
73 54
07 08
61 55
75 15
Ġend Time
61 23
Ġ15 00
Ġclaim Rank
78 94
04 88
To Mint
C ard
Ġ8 42
Ġ10 94
Ġ11 00
Ġ16 94
01 54
21 58
74 69
25 83
Ġ18 48
70 28
xad f
01 04
Ġ19 64
71 45
68 93
Ġ11 05
Ġ18 14
72 69
75 08
68 76
70 94
pla yer
63 05
73 64
Ġ15 33
Ġw allet
Ġ commit
Ġ11 33
Ġ112 000000000
Qu orum
03 0000000000
78 45
Ġ8 000000000000000
77 24
Ġ18 98
Ġ17 93
_ ()
_ ()':
96 95
97 65
vi ties
te p
Ġm er
end Time
f ig
71 94
Ġ5 27
74 14
6000 803
c rowdsale
Ġc rowdsale
75 88
07 94
61 94
66 0000000000
Ġacti vities
c calltrace
ment s
ish ing
ircula ting
28 54
6 00000000
changeFee Account
ĠchangeFee Account
93 0000000000
76 68
02 22
ir Drop
mer kleRoot
Ġmer kleRoot
Ġ testTrade
63 44
24 38
h ishing
Ġ com
Ġ orders
61 06
available Volume
Issued Total
73 11
000000000000000000000000000000000000000000000000 00000
Ġ14 99
Ġ18 18
71 08
75 48
90 92
65 85
78 88
98 12
ist s
Ġ93 000000000
75 35
76 21
Ġ14 68
Tokens PerEth
74 91
set S
From Whitelist
Ġ14 35
Ġa mountFilled
893 41
a mountFilled
76 99
Ġ86 000000000
25 38
98 05
23 18
Proxy Implementation
De stroy
Ġ18 85
Ġ115 000000000
Ġ-------- -
Ġ105 2
Ġ11 04
Ġ83 000000000
Ġ_ _
Ġ11 62
Ġ11 93
Ġ19 05
74 94
78 91
92 22
Ġ16 68
98 33
ing Time
Ġ135 000000000
cdc b
25 00000000
75 34
72 21
88 31
of fer
95 38
000000000000000000000000 9
63 52
xba ba
75 68
77 03
23 58
73 99
Ġ14 45
Ġ94 000000000
28 45
78 15
61 21
61 31
Ġ15 04
95 17
92 03
Ġ11 14
75 44
Ġ17 03
Ġ19 08
63 64
la unch
97 93
Ġ12 94
Conversion Fee
19 05
TO R
s wap
71 05
75 43
78 44
Ġ4 80
RES ALE
irculating Supply
000000000000000000000000000000000000000000000000000000000000002 0000000000000000000000000
07 01
04 00
Ġ6 27
Ġadd ToWhitelist
Con vert
va ult
0000000000 1
72 25
74 18
Ġ18 93
Ġ9 08
af ed
61 91
28 91
63 48
add ToWhitelist
98 94
61 95
bat Fund
bat FundDeposit
Ġbat Fund
Ġbat FundDeposit
S ALE
0431 182
Ġ38 8
71 58
63 14
01 14
5 342
00 34
98 99
92 21
M INI
01 93
65 64
75 14
98 14
63 95
23 91
12 28
63 84
76 74
07 24
Ġex it
71 93
01 05
90 95
o u
73 34
73 38
66 05
mint Timelocked
Ġmint Timelocked
IM UM
Ġ9 64
Ġ106 000000000
75 24
21 46
04 0000000000
0000000000000000000000000000000000000000000000000000000000000000 01
F irstDay
23 68
Ġfee Take
Ġ4 40
99 85
ab bd
98 18
Ġ17 68
ma rketingWallet
71 68
Ġma rketingWallet
65 35
28 14
79 000
42 01
Ġ135 546
21 84
Ġ5 000000000000000000
24 45
Ġ461 09
25 45
Ġ3 000000000000000000
65 91
98 55
Ġ8 34
66 91
77 08
M UM
77 93
Ġ113 000000000
Ġin it
MINI MUM
21 44
Ġ38 2
Ġset Token
10 96
Percent Of
63 94
Ġ116 000000000
fee Take
25 78
25 11
ĠswapExact ETHFor
ĠswapExactETHFor Tokens
V al
Ġ4 09
06 95
Ġ25 000000000000000
S tep
SI ON
71 84
75 000000
Ġp hishing
Ġ45 1163
985 7887
Ġ3441 9857887
Ġ34419857887 2420
Ġ5 92
61 11
64 33
72 78
21 04
Ġ8 43
fee Make
Ġfee Make
Grant Authentication
61 32
Ġ126 000000000
64 50
98 24
Di visor
5 00000000
71 99
75 00000000
O raclize
set Token
74 81
96 91
Ġ13 48
Ġ8 23
Ġ15 58
vo te
changeFee Take
ĠchangeFee Take
71 15
64 482
Ownership Transfer
distribu te
1 000
Ġ5 87
02 24
'] })],
changeFee Make
ĠchangeFee Make
75 95
82 01
21 22
Transfer Tokens
00 95
Ġ9 28
Ġ-------- --
is Main
64 91
Ġis Main
Share s
07 65
21 15
Ġ38 4
Ġ15 08
fee Rebate
Ġfee Rebate
changeFee Rebate
ĠchangeFee Rebate
74 24
74 98
74 82
63 31
0000000000000000000000000000000000000000000000000000000000000000 3
96 28
Ġ14 0000000000
Ġ14 18
1 616
U S
e aaa
Ġ accountLevelsAddr
75 03
64 42
Ġ12 08
change AccountLevelsAddr
Ġchange AccountLevelsAddr
Ġflush Tokens
04 85
75 84
06 99
Ġ12 05
003 000
ting Fee
set MintAgent
Ġset MintAgent
Ġmint Agents
Ġ4 000000000000000
1 000000000000000000000000
64 48
Ġ18 15
97 08
mint Agents
25 99
72 93
92 05
Ġ68 8
73 98
M an
p s
28 01
21 24
Ġ16 0000000000
On TransferTokens
Suppor tingFee
SupportingFee OnTransferTokens
Ġ123 000000000
Ġ 644
Ġpro xies
3 718
G E
as h
64 04
98 93
Ġ101 000000000
ĠswapExactTokensFor ETH
64 18
Ġ18 05
xfb b
reation Time
23 55
76 61
76 78
Ġ5 47
Amount s
Ġ691 45
63 88
98 38
00000000000000000000000000000000 000000000000000000000000000000000000000000000000000000000
63 04
21 34
t arget
06 65
92 68
73 78
25 58
Ġ11 15
98 48
72 22
14 59
B ur
06040518 0910390
is Operator
74 08
Ġ5 10
00 38
66 65
Ġ14 93
64 14
72 71
Ġ94 831
