#version: 0.2
0 0
Ġ '
' :
00 00
o n
0000 0000
c t
c e
a l
i on
ct ion
u n
f un
Ġ ;
fun ction
Ġ' ,
e r
r e
r a
s s
i n
t ra
d d
a s
v i
e w
Ġ 1
vi ew
Ġ view
' ,
re ss
dd ress
a ddress
) ':
b l
00000000 00000000
r i
{ '
2 5
Ġ 0
i s
g as
[ {'
} ]
č Ċ
d e
p a
in t
on ce
n once
t y
n s
u int
tra ns
25 6
c k
a n
al l
Ġ 2
c h
Ġ pa
an ce
bl e
a ble
P ri
Ġpa y
Ġpay able
p l
Ġ 3
u s
u e
m b
( )
( )':
al ance
on e
N one
b alance
v al
o ck
e e
I n
s e
p e
Pri ce
de x
In dex
c on
a in
tra ct
mb er
u mber
N umber
a ction
bl ock
I d
val ue
trans action
g o
gas Price
ty pe
block Number
ch ain
transaction Index
chain Id
con tract
pl us
go plus
r o
c all
F ee
m a
ma x
Ġ F
al se
ĠF alse
0000000000000000 0000000000000000
P er
ri ty
G as
Fee Per
FeePer Gas
Ġ call
00 0
f er
t o
00000000 0
Ġ 4
trans fer
tra ce
t e
Ġ 5
a c
o w
ro m
Ġcall trace
is t
a ck
7 1
9 9
L ist
2 8
6 1
] ,
6 5
n er
0 1
7 5
6 8
6 4
7 4
2 1
3 8
2 4
0 5
P a
9 4
7 8
9 5
[ ],
ac ce
9 1
Ġ to
6 3
0 4
7 3
o rity
9 8
y Pa
acce ss
yPa rity
access List
max Pri
max FeePerGas
ority FeePerGas
maxPri orityFeePerGas
Ġ [],
0 8
2 3
0 3
' }]
Ġ _
t ch
u p
f f
b ack
d is
all back
tch er
dis pa
dispa tcher
9 3
f allback
v e
Ġ2 1
00000000 00
Ġ transfer
p ro
00000000 0000
te s
ow ance
i m
p pro
0 2
de c
Ġ3 8
y tes
b ytes
Ġ 8
Ġ1 5
O w
Ow ner
1 8
o l
Ġ3 7
1 5
e d
7 2
6 6
1 4
O f
t al
F rom
m e
3 5
0 6
f rom
- -
g e
3 4
pl y
S up
ppro ve
Sup ply
7 6
balance Of
tal Supply
00000000000000000000000000000000 0000000000000000
3 2
9 2
Ġ1 4
Ġ p
h i
a pprove
1 1
c a
c o
9 6
Ġ 6
Ġp u
l l
7 7
as e
Owner s
hi p
a me
Owners hip
Ġpu re
k e
5 4
3 3
T o
n ame
Ġ21 000
y mb
ymb ol
s ymbol
al s
dec im
decim als
Ġ1 8
5 8
Ġ' _
9 7
all owance
2 2
ase A
Ġ T
re aseA
co de
0 7
ĠT r
" {'
" }]
} "}]
Ġ "{'
Ġ' }"}]
ĠTr ue
Ġ"{' _
Ġ1 1
4 4
2 6
ow ner
8 8
3 1
0 9
a f
4 5
000000000000000000000000000000000000000000000000 000000000000
Ġ 9
se t
B l
a d
3 6
4 8
2 7
t h
x b
x f
a b
ge t
2 0
5 5
Ġ balanceOf
Bl ack
g ra
Ġ 7
x d
to talSupply
1 6
n d
ll owance
reaseA llowance
Ġ 25
Ġ1 3
9 0
x e
To ke
us e
s t
a a
gra de
b u
Ġ approve
Ġ2 8
Ġ --
Ġ2 000000000
Ġtransfer From
2 9
4 1
6 7
n t
o r
8 5
d b
c b
a te
00000000000000000000000000000000 00000000000000000000000000000000
Ġto talSupply
7 0
in g
f a
ff ff
1 3
f b
8 4
Ġ1 2
6 2
transfer From
Ġ None
Ġ name
e b
Ġ symbol
r n
Ġ decimals
f c
Ġ2 0
7 9
o un
Ġ allowance
m in
Ġ re
x c
0000 0
up grade
a t
in c
1 2
bu rn
m int
d c
4 3
4 6
Ġ1 6
e c
5 3
8 1
e f
pa use
5 6
5 1
Ġ owner
call trace
3 0
Ġ2 7
b b
Black List
d a
e a
8 2
3 9
Ġ set
3 7
5 0
x a
te d
Ġ get
5 7
Ġ -
Ġ de
5 2
1 7
c f
Ġ9 0000
4 7
Ġ1 7
T ra
an ge
f d
ch ange
c c
4 2
71 28
Ġ2 0000000000
us ed
f e
8 0
8 6
Ġ' }]
ppro val
Ġ e
000000000000000000000000000000000000000000000000000000000000 00
4 9
Ġtransfer Ownership
transfer Ownership
Ġ20 7128
Ġ15 00000000
dec reaseAllowance
inc reaseAllowance
i th
Ġ1 0
6 9
0000000000000000 00000000
1 0
d ra
Toke n
l e
1 9
n oun
ce Ownership
noun ceOwnership
6 0
8 3
0000 000
Tra ns
000000000000000000000000000000000000000000000000000000000000 000
A ddress
b a
b c
5 9
00000000 000
Toke ns
d f
4 0
8 7
Trans fer
dra w
Ġ s
un pause
ith draw
p re
i t
C all
ke n
b f
upgrade To
o ol
pre ca
a dd
reaseA pproval
A nd
w ithdraw
er s
Ġ1 000000000
b ool
th er
Ġ se
m o
at ion
un d
a r
And Call
M int
mo ve
A d
Ġ1 9
Ġ1 02
8 9
b d
ffff ffff
F und
Ġse nd
Ġ2 2
000000000000 000
Ġ mint
Ad min
0000 00
Ġ2 4
Ġ burn
Ġ1 00000000
Ġ3 5
a e
Ġe ther
S t
af e
A ll
me nt
c d
I N
Ġ is
b e
u m
de e
Ġ2 3
000000000000 00
pl e
M A
r ing
Fund s
to r
R e
Ġ4 2
im um
F or
t ion
ro y
ad min
st roy
Ġ c
Ġ25 0000
st ring
Ġ-- --
Ġ4 5
Ġ 65
ple ment
Ġ102 000000000
balance s
plement ation
Ġ 99
R ate
MA X
Ġ 94
ow ed
Ġ 63
000000000000 0
Ġ1 05
l a
Ġ2 6
Ġ 61
Ġ 75
Ġ increaseAllowance
Ġ decreaseAllowance
Ġpa used
pa used
im plementation
Ġ3 1
ss ue
Ġ5 0000
Ġ 64
Ġ change
5 05
Ġ3 4
t er
p o
ers ion
all owed
Ġ 74
is ted
re nounceOwnership
Ġre nounceOwnership
Ġ3 3
ee ee
Ġ4 8
i ssue
99 5
Ġ1 00
is h
64 4
IN T
Ġ 71
Ġ5 5
Pa ra
Ġ1 18
im e
u l
Ġpa use
in ish
Ġ 73
dee m
Ġ5 1
Ġ4 1
z e
Ġ 68
Ġ3 2
r d
Ġ unpause
Ġ3 6
v ersion
at us
Ġ-- -
to ken
Ġ 78
St atus
7 91
Ġ withdraw
Ġto ken
C on
Ġ 95
po s
P o
Ġ upgradeTo
L isted
75 1
max imum
d Address
m s
U INT
9 38
Para ms
preca ted
Po int
Ġ1 15
preca te
Black Listed
as is
asis Point
add BlackList
move BlackList
Black Funds
BlackList Status
Ġ4 4
asisPoint s
maximum Fee
stroy BlackFunds
b asisPoints
basisPoints Rate
upgrade dAddress
Ġ f
inc reaseApproval
dec reaseApproval
Ġ1 01
Ġ1 21
Ġ1 00000
5 15
Ġ1 04
ge nt
e t
oun t
ct or
Ġ1 24
Ġ4 6
7 95
61 5
a p
7 00
9 08
Mint er
pos it
U p
Ġ4 3
Ġ1 08
A c
Ġ2 9
Ġ5 0000000000
0000000000000000 0
98 4
A pprove
al e
Ġ1 35
R I
_ (
Ġ5 4
Ġ1 28
75 6
00 1
24 8
4 94
Ġ 91
Ġ5 3
Up grade
Ġ1 25
le g
3 05
Ġ1 14
Ġ 66
Ġ1 34
al i
Ġ5 8
Ġ1 38
Ġ1 03
Ġ3 9
nonce s
T ime
71 9
co un
Transfer From
For All
P ro
coun t
Ġ1 23
71 4
ctor y
Ġ 98
Ġ1 94
0000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000
9 01
M a
7 74
Ġ5 2
Ġ 93
25 9
Ġ3 0
73 9
Ġ5 00000
Approve d
Ġ 72
Ġ1 65
74 5
Ġ21 000000000
ffffffff ffffffff
la im
afe TransferFrom
000000000000000000000000000000000000000000000000000000000000000 1
Ġ1 11
Ġ3 000000000
ar t
l ock
01 5
A gent
97 9
Ġ1 74
94 7
Ġ1 68
Ġ8 4
Ġ4 9
Ġ5 6
00 4
28 8
25 8
3 65
Ġ4 7
9 68
p t
Ġ1 61
Ac count
00 2
t s
E T
99 99
78 2
fa ctory
Ġ1 93
O rd
[ ]
21 8
9 65
Ġ 77
U RI
de d
e n
3 24
Ġ1 95
ET H
2 23
Ġ5 0
Ġ admin
2 06
a tor
Ġ4 0
o ca
Ġ8 8
21 7
61 6
75 5
Ġ3 0000000000
Ġ1 64
Ġ6 2
Ġ 76
91 3
7 64
p or
21 4
0 24
01 8
68 1
00 8
Ġs w
Ġ1 78
f dd
v er
p er
Ġ1 71
Ġ balances
Ġ1 0000000000
14 8
acce pt
ul t
Ġ8 1
9 05
All oca
In ter
000000000000000000000000000000000000000000000000 00000000
Ġ2 00000
E R
Ġ1 91
Ġ MAX
Ġ1 22
21 0
Ġ implementation
Ġ5 7
73 3
fa ce
71 8
4 61
Bl ock
ar d
Ġ 92
Ġ1 75
x ad
Inter face
2 05
A L
Ġ6 0000
00 5
74 6
up por
24 4
95 8
uppor ts
71 1
upports Interface
Ġ1 63
Ġ1 33
A u
accept Ownership
74 8
vi s
65 9
98 3
Ġ8 5
Ġ 96
Ġ allowed
m ount
Ġget Owner
get Owner
38 9
3 14
0 28
ce c
0 63
Ġ issue
04 8
F inish
c ol
3 644
Ġ1 31
Finish ed
25 1
d ate
25 4
T I
per ator
ro ll
Ġ a
ve s
Ġ5 9
08 8
78 4
6 000
change Admin
Ġchange Admin
0 38
ff f
Ord er
00 3
75 8
99 8
68 5
24 9
61 8
ri bu
78 8
l ist
71 3
25 5
73 4
61 1
75 4
28 4
b db
21 5
63 5
Ġre deem
Ġ6 7
68 8
68 4
98 5
Ġ1 36
65 5
i g
Ġ1 32
65 6
01 6
61 4
re deem
03 1
63 3
P L
23 4
73 1
99 7
S U
64 8
roll er
xd c
71 2
xf b
97 0
28 5
ad f
25 2
Ġ6 9
65 8
38 8
24 5
i l
01 1
63 4
98 8
99 1
04 5
SU P
PL Y
SUP PLY
Ġ1 06
03 9
78 5
94 4
x ca
ing Finished
01 4
04 4
Mint ing
d ing
Ġ1 26
03 5
72 6
x af
21 1
03 3
73 5
45 9
65 4
eeee eeee
71 5
B alance
Ġ11 6
hi te
de precated
Ġde precated
de precate
Ġde precate
Ġis BlackListed
is BlackListed
96 2
set Params
Ġset Params
64 5
Ġ addBlackList
re moveBlackList
Ġre moveBlackList
get BlackListStatus
Ġget BlackListStatus
Ġ maximumFee
de stroyBlackFunds
03 4
Ġde stroyBlackFunds
Ġ6 0
Ġ basisPointsRate
Ġ upgradedAddress
99 4
78 1
Ġ increaseApproval
Ġ decreaseApproval
leg ate
23 1
re ate
01 0
74 2
to col
t roller
ke ns
u r
tocol Fee
upgradeTo AndCall
ĠupgradeTo AndCall
25 3
re nt
ac cf
99 3
21 6
38 6
23 5
66 6
94 8
38 4
Ġ14 1
96 9
ee p
28 2
91 8
08 2
xf a
Ġ8 3
74 4
0000000000000000 00
04 6
05 8
02 2
93 4
98 6
04 1
03 6
val i
Ġ1 27
W ETH
A mount
65 1
21 95
98 1
Ġ st
inish Minting
24 1
91 5
64 1
23 3
00 6
Ġ8 2
Ġ8 6
B y
95 1
91 4
92 6
95 4
a m
0000000000000000 000000000
to tal
A t
Ġ version
Ġ 97
28 1
76 2
08 4
08 1
63 2
93 5
73 6
D e
74 1
Ġ4 0000000000
95 5
08 5
0 94
i ll
38 1
25 7
99 6
Ġ11 3
02 75
63 6
A pproval
91 1
Ġto tal
63 9
Ġ8 9
24 7
63 1
08 3
Ġ14 4
66 2
0 68
72 2
s er
05 4
00000000000000000000000000000000000000000000000000000000000000 1
21 3
99 2
Ġ1 07
72 7
38 0
93 1
18 2
38 5
Ġburn From
Ġ11 7
Ġ1 73
71 6
34 6
78 6
burn From
tes t
Alloca tion
o d
n able
Ġ14 5
05 1
Ġ4 000000000
i r
64 3
65 3
23 6
38 2
Ġ14 8
Ġ add
61 3
Ġde posit
78 3
25 0
75 3
all et
i gra
O N
91 2
01 2
94 5
64 2
re e
93 3
Approval ForAll
04 3
02 6
68 2
21 2
Ġ7 9
18 3
88 03
Ġ11 2
91 6
Ġ1 66
05 5
to p
24 2
61 2
or d
S ale
72 9
Ġ nonces
68 6
35 7
Ġ8 7
in ali
64 6
61 7
Ġ15 8
c da
28 3
938 2
5 20
74 3
94 1
i c
Ġ5 000000000
1 739
04 2
73 2
i ve
v a
x ac
24 3
db ee
E N
76 7
ab e
75 2
Ġ---- --
63 7
Ġ18 8
2 751
95 2
38 3
03 2
58 5
23 2
ab de
x ded
75 9
xb aa
O perator
Pro tocolFee
33 700
cb afe
2 979
28 6
28 0
fb f
M in
24 6
35 3
5 984
Ġ15 5
Ġ15 0000
65 7
Ġ1 09
as ter
91 7
2195 995
00 7
23 7
98 7
Ġs afeTransferFrom
61 0
i od
M aster
93 6
77 7
e ad
Ġ in
Approved ForAll
75 7
26 2
01 3
93 0
Per iod
21 9
C ount
14 5
c laim
ult i
63 0
68 3
s ale
65 2
x y
98 0
28 7
o t
93 2
Ġ14 3
64 7
Ġ7 0
d af
04 7
08 6
92 7
0000 01
Ġ1 67
Ġ11 9
94 6
93 7
W hite
pe nd
Ġ1 29
da tor
Ġ15 3
us h
Ġ14 6
z ed
02 7
76 0
02 0
Ġsw ap
74 7
le ase
F allback
Ġ6 0000000000
71 7
Ġ15 1
re ation
66 7
Ġ o
92 2
By Index
18 9
16 0
99 9
96 7
03 7
xd f
01 7
76 9
ree ze
73 7
06 2
s afeTransferFrom
95 6
Con tract
95 7
Ġ1 72
38 7
L ock
23 9
98 2
0000000000000000000000000000000000000000000000000000000000000000 000000000000000000000000000000000000000000000000
94 3
34 8
va il
vail able
Ġ1 000000
18 8
Ġ1 62
05 3
35 4
05 2
aa a
W allet
78 7
95 3
68 9
Ġ15 4
oun d
Ma tch
Ġ m
05 6
Ġ8 0
94 2
68 7
73 0
11 27
00 9
74 9
15 8
Ġ factory
08 7
58 6
Ġ14 2
k er
a tes
a ke
Ġ13 7
18 1
c ul
Ġ18 4
Ġ14 7
06 7
04 0
18 4
xe c
Ġ9 0
leg ates
Token Transfer
77 9
06 9
fc fff
u t
22 6
06 0
B u
1 28
01 9
xf e
34 3
15 5
03 0
Ġre move
Ġ35 0000
f ee
1 18
35 5
Ġ1 20
78 0
re move
Ġ15 2
34 2
Re ser
Ġ15 6
x ab
23 0
[] )
[] )':
35 2
n ew
Ġ18 5
71 0
02 9
ker ProtocolFee
35 8
Ġ1 76
75 0
74 0
Ġ25 000000000
92 9
i e
92 0
64 9
Ġ18 1
4 03
04 9
64 0
66 9
93 9
78 9
11 1
In f
05 0
77 0
Ġ18 3
96 0
g ist
14 4
61 9
24 0
774 1
06 00
ro w
08 0
68 0
IN I
33 6
ea m
98 9
T eam
34 5
28 9
al cul
33 3
34 4
Ġ1 0000000000000000
Au ction
bu y
alcul ate
w ard
it i
Ġ2 01
2 02
206 06
i ty
co m
ase URI
14 3
72 0
Ġ1 92
Con troller
07 0
lock ed
e fb
A dd
91 0
Ġ2 04
Ġs upportsInterface
C o
Ġapprove AndCall
Ġ un
approve AndCall
05 7
148 54
f cb
nable d
S ig
Ġ11 0
26 0
95 0
32 6
xb f
09 0
91 9
vis or
T O
8 73
Ġ1 00000000000000000
Ġ acceptOwnership
s upportsInterface
St art
365 68
fdd f
22 2
5 58
54 7741
5 54
Ġ1 77
66 0
Ġ3 00000
99 0
D i
E nabled
fa e
Ġ---- -
Ġ6 000000000
07 9
Ġ14 0
94 9
ist ribu
Ġ13 9
ER C
Ġ15 9
1 00
xb c
Ġ1 98
00000000000000000000000000000000000000000000000000000000000000 2
Ġ13 0
Ġ18 7
de posit
34 1
65 0
M ain
igra tion
Ġ1 99
94 0
15 1
08 9
Transfer s
Ġ14 9
48 6
le aseA
Ġ18 6
s w
bc d
dd d
14 1
Ġc laim
98 65
45 6
TI AL
INI TIAL
09 01
eb b
Ġ15 7
22 7
18 5
x change
ca p
26 7
Ġ2 44
row d
4 08
54 6
35 6
33 1
Ġ5 58
ord er
White list
95 9
db b
t ribu
Ġ upgrade
15 4
Ġ18 2
D E
Ġ2 00
26 9
Ġ1 79
Ġ8 0000
Ġ12 0000
Ġ15 000000000
mint ingFinished
Ġmint ingFinished
Ġ12 0000000000
R ound
32 2
t ime
ra c
34 7
8 58
31 2
31 3
am p
K EN
a ce
16 7
M ulti
Ġowner Of
st amp
E nd
ance l
W ith
48 5
Time stamp
000 1
35 1
15 3
fun ding
Ġde legate
908 3
Reser ves
31 9
000000000000000000000000000000000000000000000000000000000000000 2
Ġ2 08
to kens
ur rent
Ġsw eep
E th
ffffffffffffffff ffffffffffffffff
Ġ b
x ff
Ġto kens
Of Owner
4 01
la test
15 2
11 6
Ġ2 05
01 24
000000000000000000000000000000000000000000000000 000000000
54 8
Ġ42 000
Au th
st art
31 6
h as
Ġ con
22 0
Ġ1 70
Ġ WETH
a af
u i
Pro xy
x ce
C reation
Ġ15 0
55 5
04 05
ro ze
15 6
Ġf inishMinting
f inishMinting
roze n
N ame
88 4
E ther
e nd
x cb
Ġ1 96
000000000000000000000000000000000000000000000000000000000000 01
54 5
965 0
v o
44 9
14 0
new Owner
11 9
05 9
y s
R E
f de
I C
14 6
x aa
18 6
Ġset ApprovalForAll
54 4
9865 0275
Ġ8 000000000
44 8
s c
11 2
54 3
54 1
vali date
Ġ2 03
901 0
u th
Ġget Reserves
00000000000000000000000000000000000000000000000000000000000000 4
Ġ25 00000000
Ġ3 00000000
Ġ1 000000000000
Ġ16 9
58 4
Ġ4 65
eeeeeeee eeeeeeee
44 5
Ġst art
xb d
14 7
76 000
36 2
Ġ16 0
f reeze
rac le
at a
Ġ22 000000000
sw eep
32 0
58 8
33 7
44 1
Ġc reate
48 4
314 0
Ġ 256
V ali
Ġ1 00000000000
22 9
com m
fun d
de legate
Ġ18 9
Ġ2 25
48 2
TI ON
ce f
11 3
i p
e ve
44 4
45 1
3 995
inali zed
494 04
18 7
88 8
4 659
12 210
Ġ max
ce nt
A P
De posit
48 1
34 0
27 9
Ġ2 21
leaseA gent
ce ss
80 38
48 3
up date
ie nt
5 71
Ġ1 90
ip ient
St ate
54 9
p tion
2 00
Ġ21 0000
4 72
Inf o
Tra ding
18 0
e ce
ol d
Ġ2 24
k ill
32 7
latest Round
15 7
82 05
000001 459
41 3
r y
d ac
58 1
R ew
Ġ2 31
P re
14 2
Ġf ee
7 21
c reate
Add r
xc f
R ec
Ġ2 34
ct i
te am
Rec ipient
9 24
Rew ard
55 3
c ca
ce ive
913 93
C ap
54 7
Ġ2 33
5 78
000000000000000000000000000000000000000000000000 00000000000
Ac cess
u te
58 3
53 91393
Ġ42 0000
Ġ pro
45 2
o ut
Ġ4 61
sc ri
36 0
an a
on TokenTransfer
27 0
05 05
Ġ2 23
To tal
31 0
36 7
scri ption
Ġ5 0000000000000000
Ġ2 35
C an
un ity
33 0
C l
Ġis ApprovedForAll
9 72
ca f
vo ke
set ApprovalForAll
is ApprovedForAll
B aseURI
29 03
55 1
eb e
Ġ24 000000000
67 9
Ġ51 000000000
33 9
Ġ min
45 3
98 04
Ġ18 0
D a
inali ze
Ġ w
Ġ21 8
756 983
16 9
b af
16 94
xfe af
F ill
45 5
000000000000000000000000000000000000000000000000 000
Ġ2 28
Lock ed
owner Of
3 72
15 0
pend ing
Vali dator
ves tor
c cb
Ġ2 38
Ġ1 97
xb b
5 26
o ri
000000000000000000000000000000000000000000000000 00
f t
xec ute
16 2
8 31
11 7
K e
Ġ2 06
1 93
Ġ2 88
53 9
vali dator
54 2
iti ali
Ġtoken Fallback
b ab
Ġis Owner
52 68
token Fallback
is Owner
I T
35 0
31 7
6 07
000000000000000000000000000000000000000000000000 0000000000
OfOwner ByIndex
S h
Ġ21 5
13 7
Ġ2 02
p u
ca e
e s
6 02
84 0
00000000000000000000000000000000000000000000000000000000000000 6
9 03
44 2
Ke ys
q ui
as t
9 21
xa e
88 7
token URI
Ġtoken URI
dis able
5 23
Agent s
Ġ21 4
TO KEN
Alloca ted
f aa
Ġ12 000000000
Ġget Approved
04 64
11 0
get Approved
8 25
84 3
Ġ2 48
Ġ4 00000000000
en ce
Ġ4 88
67 0
F inalized
pe n
85 2
54 0
ra ge
45 7
14 9
to rage
U n
0000000000000000000000000000000000000000000000000000000000000000 1
34 9
Min imum
t ing
Tra de
T a
Ġ2 61
58 2
Ġ35 000000000
7 714
vis ers
Ġ2 75
745 00
00000000000000000000000000000000000000000000000000000000000000 8
1 61
35 9
l ast
6 288
36 9
gist ry
b de
6 24
00 160
3 969
E xchange
65 21
pend er
M igration
as ed
41 2
has h
5 00
586 09
fc d
Mint ed
61 01
32 9
dra ft
ver draft
Ġ3 01
ment Amount
57 970
8 38
403 17
408 84
s Enabled
time out
C E
j in
jin Team
93 74500
vailable Funds
racle Count
6288 06
T E
ch i
ge n
g er
pe d
41 7
Ġpu ll
Ġ1 000
000000000000000000000000000000000000000000000000 0000
ra nt
s top
Ġs top
an da
pu ll
anda rd
0600 20
tribu te
Ġ5 01
Ġ21 1
l ush
de legates
Ġde legates
8 13
ro p
1694 505
Ġ1 000000000000000000
d ff
Ġ6 91
S et
Ġ3 15
5 755
rowd sale
55 2
55 6
Ġ4 85
81 9
Upgrade d
44 3
44 6
le ased
Upgrade Master
i d
Ġs afe
Di ct
bl ack
86 0
xb a
Upgrade Agent
68 764
im it
58 7
ancel Order
Ma kerProtocolFee
validate Order
Can Match
Ta kerProtocolFee
Ġ21 3
Ġ2 43
s torage
( {'
} )
At tribute
storage Keys
Attribute Dict
Ġ2 07
Upgrade State
5268 389
G rant
13 0
Ġ [
n o
88 3
9 73
51 7
5755 29
2 38
Ġ105 000
I M
53 7
Ġ2 64
3 73
tra de
bb e
0 99
dd b
d istribu
Ġ2 41
s afe
f af
Ġ2 68
ac b
L imit
1 94
Ġc alculate
q ue
Ġde stroy
xd b
8 28
f ir
Ġ7 0000
dd c
Fund Deposit
Ġ2 45
b ce
y ERC
add Minter
Ġadd Minter
5 65
50 23
3 15
Ġ buy
de stroy
Bu rn
85 1
fc c
x ee
Re ceive
m er
Ġ5 00000000
ord ers
Ġ2 73
w ap
61 00
48 7
Ġset Owner
u b
0 21
01 56
ad visers
A TE
comm unity
B A
set Owner
d ab
4 38
13 9
00000000000000000000000000000000 000000000000000
Ġ2 00000000000
S E
c alculate
fb b
e x
30 68
4 14
Ġ3 33
Ġ11 000000000
Ġ2 26
00000000000000000000000000000000 00000000000000
Ġ2 22
RE S
8 05
88 5
55 0
ff d
L O
Ġ3 05
en able
Ġ21 6
Ġ2 74
Multi ple
58 9
Ġ21 2
Ġ2 63
15 9
le ct
78 23
L eve
33 18
Leve l
Ġ2 99
Ġ21 7
Ġ7 000000000
56 0
4 21
f dc
Ġ2 65
D ate
C urrent
46 0
Ġ2 91
88 2
Ġ2 09
C ON
84 9
15 26
ana ger
B U
23 00
88 1
Ord ers
W ithdraw
With Re
Da y
4 04
55 7
xe a
ver n
go vern
ed a
58 0
n ap
44 7
db d
b ec
44 0
Ġe nable
3 35
V ER
Ġ4 63
43 7
Ġ2 00000000000000000
itiali ze
ff e
ch e
gist er
Ġ4 0000
ca b
Ġ28 000000000
f ec
a ee
2 03
fer ence
Ġ2 93
Ġ41 000000000
1 95
change Fee
Ġchange Fee
6 00
8 76
WithRe ference
84 7
76000 80
5 99
visor s
Ġ lock
C I
f ac
fcb af
9 00
Ġ4 23
Ġtransfer AndCall
c ac
8 08
Ġ25 5
MA L
DE CI
DECI MAL
F a
Ġre lease
4 91
Ġ2 32
00000000000000000000000000000000 000000000000
Ma x
s Addr
2 000000000000000000000000
b ed
6 63
fb c
f db
re lease
6 95
Ġ3 04
9 04
Ġ INITIAL
Ġis Minter
T ake
is Minter
an Upgrade
Ġ2 94
Ma ke
e cb
ar get
ff c
R eb
Reb ate
Ġ2 71
a ed
Level sAddr
Ġ3 75
S e
x ed
xc d
000000000000000000000000000000000000000000000000000000000000000 4
Ġ order
Ġ45 000000000
25 21
ct ive
258 01
xca b
b ee
Ġ4 64
transfer AndCall
xf c
84 6
m it
Ġ7 73
Ġ25 1
8 34
7 61
cc d
81 346
6000 526
Ġ2 27
I s
Ġ2 95
858 183
42 712
Ġ3 18
fde ed
Ġ2 36
49 616
Ġ2 98
c dc
f eb
af b
88 6
Ġ9 000000000
0000000000000000 0000000000
000000000000000000000000000000000000000000000000 000000
48 0
x dee
e ca
1 73
a cti
7 04
fd f
c fb
3 214
d ca
Ġ3 03
Ġ2 42
xe fdeed
Ġ4 95
Ġ45 6521
Ġ5 00
D istribu
585 733
85 6
49616 997
A r
Ġ2 78
000 2
l y
000000000000000000000000000000000000000000000000000000000000 0
c fc
000000000000000000000000000000000000000000000000000000000000000 3
ff a
85 7
2 65
6 01
4 92
51 0
1 36
6 04
Ġ2 0000000000000000
e ab
Ġ25 8
IC AP
Bu y
n e
S T
T y
Ġ3 08
Ty pe
7 23
1 68
Ġ AttributeDict
66 68
}) ,
Ġ2 47
55 9
Ġ4 14
08 01
x de
Ġ cap
Ġ4 35
ee d
38 38
a ab
Ġf reeze
l o
6 99
Ġ18 000000000
Ġ[ '
fb e
Ġ funding
Ġ52 000000000
' ]
x dd
Ġe xecute
To ICAP
Ġ25 2
cent i
pa rent
Ġpa rent
494 6
3 01
Ġ2 37
Ġ3 28
48 9
1 01
66 24
6 65
black list
2 21
A ctive
8 35
ma tion
85 3
l isted
0 74
3318 585733
04 36
ad a
i rd
2 71
Ġ3 68
ke ting
ad c
41 9
8 00
g th
b cc
51 9
db a
75 71
Ġ------ --
07 91
9999 9999
pl it
Ġ3 35
Auth ority
L en
Ġ4 11
f ab
S I
Ġ25 3
Ġ2 29
Ġ2 46
ird rop
min ate
Ġ2 66
Ġ4 99
vestor s
0156 00
uth ority
centi vis
81 7
1 99
Ġ newOwner
Ġ2 39
5 64
Ġ3 74
Len gth
cf e
45 0
b cb
41 0
Ġ3 0000
Fa ctory
Fill s
Ġ26 000000000
000000000000000000000000000000000000000000000000 0000000
43 0
ff b
no minate
Ġ55 000000000
Ġ3 99
de b
Fund Address
6000526 015600
d ce
751 039
L IM
d cb
LIM IT
8 18
Ġ33 000000000
Ġ13 000000000
a eb
v ate
Sig n
3 94
9 61
1 15
P RI
04 98
84 2
fb a
Ġ16 000000000
b ac
Ġ3 14
Ġ3 24
Start Block
63 99
Allocated To
n jinTeam
centivis ation
0 71
b ef
dd e
R A
99 45
Ġ25 4
Trans action
b fd
Ġ9 0000000000
f ed
t u
in al
Ġ27 000000000
9 23
Ġ latestRound
End Block
e ac
Ġ3 45
gen c
gra nt
mer genc
5 95
tu rn
a ec
PRI CE
a ac
token Creation
Ġtoken Creation
b eb
72 76
Ġ update
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
63 74
3 78
b fa
Ġ2 79
Ġ21 9
1 24
Ġ14 000000000
56 9
015 61
7 99
1 78
Ġ5 00000000000000000
1 04
de f
Ġ6 95
xe b
Ġ2 20
uth ori
pending Owner
ne ctor
Ġ4 71
Ġ21 0
72 74
Ġ3 91
co ver
que st
Ġ3 21
02 00
Ġ3 38
O n
Ġ23 000000000
46 9
ce a
R an
b da
Re leaseAgent
24 61
Transfer Agent
a ea
t ers
y er
3 63
Ġ4 68
ad b
Ġ32 000000000
withdraw Funds
Ġwithdraw Funds
8 94
88 9
Ġ3 31
Ġ36 000000000
Ġ9 25
rozen Account
O r
Ġ3 48
ed f
Ġp ush
ves ted
1 21
Ġ4 21
73 05
Ġ3 78
Ġ3 00
U N
75 0000000000000
0000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000
1 25
ge ner
Ġ3 34
0 92
4 74
ab a
d fd
transfer Admin
Ġtransfer Admin
ab b
Ġ2 62
qui re
7 08
36 06
cb b
pa y
06 0405
Ġ3 64
Ġ3 44
C laim
p ush
Ġ4 91
Ġ5 04
Ġ3 95
3 38
All owed
Receive d
6 93
Ġ8 0000000000
aa e
E xa
DE L
Exa ct
to m
or mation
Ġ84 000
bb b
Ġ105 2
5 02
6 68
ca d
Inf ormation
N ew
Ġ31 000000000
c dd
b dc
Ġ4 05
2 95
9 74
Ġ onTokenTransfer
Exchange Rate
ec f
0 98
3 23
7 28
8 14
xf d
To Whitelist
cb f
fir m
0 75
D A
Ġ4 86
V ersion
Ġ team
Ġ4 75
2 98
F rozen
Ġ3 65
Ġ2 49
ic i
iti al
a ef
e dd
8 44
d fc
7 73
B et
f da
0 95
Ġ3 25
Ġ4 94
tom ic
p y
tomic Match
7 78
e ff
Co py
db c
ba tch
Ġ5 21
Ġ2 72
ea e
Re lease
5 98
1 34
test Copy
Ġ5 99
CON T
77 78
hite list
Ġ kill
28 78
8 15
21 98
Ġf inalize
M anager
S nap
ver t
Ġ3 23
Ġ3 61
af d
Ġ94 813
3 61
Token Information
a re
Ġ28 5
1 713
ce b
gener ate
Ġ4 08
ĠT O
Current Price
8 03
A D
1 02
7 38
Ġ ma
a de
Ġ3 0000000000000000
0 61
o re
1 14
25 0000000000000
Ġget Timestamp
7 03
Ġ3 55
Ġ4 15
Ġ3 94
000000000 5
6 08
A n
Ġ3 58
T AL
f or
5 73
b dd
con troller
ance ll
ea ec
7 25
db f
o de
reation Block
M E
3 28
3 18
7 94
get Timestamp
S ub
Ġ2 69
Ġ4 62
de scription
fb d
Ġ2 92
Ġde scription
Sig ner
Ġcon troller
ef e
Ġ3 63
9 75
pl ace
xd a
dc d
5 01
Ġ2 30
21 73
1 97
Ġ3 73
Ġ42 000000000
Ġ h
2 08
25 0000000
Ġremove Access
remove Access
Ġ t
Ġ3 11
000 3
b cf
generate Tokens
An yERC
88 0
af a
Ġset BaseURI
Ġ4 78
22 06
set BaseURI
Ġ2 76
db e
9 28
cb e
Ġre voke
1 05
6 78
h ase
6 27
re voke
3 90
U M
ac count
IC O
Pre sale
0000000000000000000000000000000000000000000000000000000000000000 000000000000000000000000000000000000000000000000000000000000
d aa
C O
Ġ4 18
578 94
0 78
2 28
Ġ3 93
ee e
74 64
Ġ5 0000000
Ġ validator
6 38
eb d
8 71
Ġ4 28
6 75
7 24
05 65
Ġ7 0000000000
ab c
1 91
7 71
3 08
4 28
Ġ3 02
0 91
Ġ2 67
fc f
2 24
us er
43 9
Ġ15 0000000000
4 35
Ġ2 40
xc c
ancell ed
000000000000000000000000000000000000000000000000000000000000000 8
Ġ63 000
d o
f inalize
8 78
ce e
4 98
00000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000
6 98
24 24
14 89
63 00
F inal
govern ance
f ad
i ring
34 46
Ġtoken OfOwnerByIndex
ee b
ec d
9 06
s h
Re turn
0 73
eb c
token OfOwnerByIndex
'] }),
e th
1 74
u me
6 218
vi ty
ra y
Ġ53 000
set Validator
Ġset Validator
a ff
e de
Ġ2 77
Ġ19 000000000
Ġ2 97
cb d
ee a
Ġ5 15
3 68
c ff
ffffffffffffffffffffffffffffffff ffffffff
P O
Ġswap Exact
C AP
acti vity
C rowdsale
Ġse ll
4 34
Ġ4 12
66 00
token ByIndex
Ġtoken ByIndex
Ġ3 98
53 0
Release Period
activity ReleasePeriod
3 99
Sh ot
4 95
6 94
Ġ disable
2 64
Snap Shot
SnapShot Block
Ġ4 01
75 0000000
min imum
9 25
Cl one
7 06
77 77
nt i
Ar ray
Clone Token
3 03
2 91
2 73
b df
c fa
Ġ5 00000000000
9 71
ult is
Ġ4 44
2 94
Ġ4 93
95 65
7 93
f ea
6 74
6 96
5 91
5 04
AL L
Ġ28 1
38 48
Pa used
Ġ4 00000
me ters
9 78
re ward
8 93
Ġ6 00000
Ġ28 4
ex t
Ġ3 54
Ġremove Minter
remove Minter
Ġ4 48
Para meters
Ġ move
81 0
bb d
I m
Ġmint Tokens
ie s
07 95
dc f
3 74
mint Tokens
O L
Ġ3 71
86 991
c de
4 99
5 75
d fb
i ff
dd f
Ġ5 34
456 05
3 04
e fa
ac c
3 64
024 6668
08 05
7 05
5 68
f ca
ab d
Ġ4 16
cb c
63 47
85 9
1 03
8 72
ac d
9 000000000000000000000000
b ad
old Tokens
5 61
tocolFee Recipient
0 97
Proxy Ownership
8 24
Of fer
90 71
DECIMAL S
7 98
ri ce
3 00
2 25
Ġs ale
Period s
Ġmin imum
5 14
Ġf lush
2 75
c cf
8 48
g u
000000000 1
3 75
7 01
4 54
6 03
Ġ4 03
claim Token
8 01
Ġ4 25
8 98
Ġ5 28
ca ba
Co m
ce d
Ġ4 87
Ġ6 04
Ġ29 000000000
Ġ trade
eb f
ee f
Ġ7 23
1 65
Ġ------ -
5 08
E G
Cl iff
Un vested
Ġ chi
Period Amount
85 0
R o
Period Length
Periods Number
449 022
i co
cb a
0000000000000000 000000000000000
bb c
dc c
Ġc ancelOrder
2 01
C ALL
s pender
Ġ hash
Ġp re
Ġs pender
ATE CALL
DEL EG
DELEG ATECALL
4 15
cc c
9 02
8 41
ab f
Ġ4 66
ac f
Ġpay mentAmount
pay mentAmount
Balance Of
Ġ timeout
8 54
a vailableFunds
o racleCount
Ġa vailableFunds
Ġo racleCount
d ata
Ġ22 0436
1 75
4 00
4 65
9 07
Ġ7 28
b aa
S top
4 75
b fe
3 71
06 000
6 64
Ġ17 000000000
5 38
2 61
0000000000000000000000000000000000000000000000000000000000000000 00000000000000000000000000000000000000000000000000000000000000
Con tribu
1 08
7 75
ef d
igra te
4 64
9 66
Ġ2 96
1 64
3 34
st andard
Ġst andard
161 24
Ro ot
Ġ4 98
Ġ6 05
6 28
6 61
8 04
9 63
3 91
Ġ4 04
4 62
Multi Sig
ar ded
90 91
Ġ1 256
Ġ4 32
Ġ7 78
2 99
3 77
8 61
b ea
Ġ5 35
da e
92 91
4 88
Ġ5 05
total Upgraded
Ġtotal Upgraded
3 21
5 34
c db
4 71
LO C
Ġ4 24
6 21
3 25
Ġ4 38
upgrade Master
Ġ35 000
Ġupgrade Master
SI S
Transfer Proxy
ar y
re ed
se nd
fb ee
Ġ3 22
Ġ4 33
Ġ2 60
all ow
Ġ3 16
PO INT
S end
ProtocolFee Recipient
set UpgradeMaster
upgrade Agent
Ġset UpgradeMaster
Ġupgrade Agent
1 90
change Minimum
Ġchange Minimum
Call data
xchange Token
d Orders
Ġ validateOrder
To Sign
code name
at ic
IN VER
Re place
Match Price
orders CanMatch
BA SIS
Or Finalized
ancelled OrFinalized
Final Price
Array Replace
gu arded
Calldata CanMatch
atic Call
INVER SE
guarded ArrayReplace
b ca
set UpgradeAgent
Ġset UpgradeAgent
Ġe th
Ġ3 32
Ġ5 08
af c
Im plementation
a ad
Ġst ake
2 93
8 55
get UpgradeState
Ġget UpgradeState
claim Tokens
f lush
Ġ5 25
uthori ze
Ġ3 51
Ġ n
Ġ13 75
0 25
White listed
4 23
P l
d fa
Ġ5 000000000000000
Ġre ward
2 68
5 24
Ġ5 91
Ġ4 74
8 32
P hase
Ġ4 54
re ase
Ġ3 96
Ġ4 662
ef ici
efici ary
1 98
4 96
U ns
09 010
Ġ25 200
Ġ66 000000000
m ain
1 38
S wap
9 64
dd a
xy Owner
xe f
Reser ve
Ġ3 52
Ġ4 00
99 94
bb f
se ll
Ġ distribu
01 36
8 02
3 95
Ġ5 18
5 33
Ġmint er
5 62
ol lect
mint er
Per Eth
Ġ4 34
7 97
8 92
Ġm ulti
2 04
b ff
Ġ54 000000000
1 70
fa ult
eb a
Ġ5 59
Ġ4 58
515 8
94 14
Ġre fund
47 93
a ge
Ġ3 41
Transfer able
ee c
Ġ4 50
7 76
Ġ5 61
03 46
86 9
96 000
Ġ17 632
c df
61 000
f ce
c ancelOrder
7 65
d fe
stop ped
Ġstop ped
Ġ3 06
000000000000000000000000 4
Ġ5 44
5 21
Ġ3 07
Balance s
Ġo perator
Fee s
Ġ34 000000000
72 7823
0 65
99 65
6624 727823
Ġ4662 729
Ġ17632 6624727823
Ġ176326624727823 352
8 22
d i
Ġ3 26
o perator
6 91
8 33
Ġ44 000000000
0 64
78 65
c ce
Ġ locked
transfer sEnabled
Ġtransfer sEnabled
2 74
8 65
2 09
ec c
624 96
8 99
Ġ4 31
95 35
de a
M ul
Ġ3 53
ba e
f ef
re fund
Ġe nd
Ġ advisers
9945 97
8 23
Ġ3 13
u ra
206 994597
ĠTO KEN
2206 206994597
Ġ community
0 23
Ġclaim Tokens
4 70
5 94
bb a
ac a
Ġ14 00000000
Ġ2 70
Per cent
Ġun lock
1 76
Ġ last
4 18
e fc
03 03
on us
ca a
2 66
908 194
Sh are
Ġ5 14
e af
Ġ65 000
Ġ48 000000000
Ġ5 63
For ward
681 3838
Ġ456521 47
Ġ1052 6813838
908194 3446
Ġ10526813838 9081943446
2 63
e mit
r keting
b fb
un lock
Ġ4 45
xb e
4 73
0000000000000000000000000000000000000000000000000000000000000001 0000000000000000000000000000000000000000000000000000000000000001
TO TAL
b at
o verdraft
61 02
Ġo verdraft
Ġb at
b fc
ed c
Operator s
n u
4 05
Forward er
5 74
S iring
Ġ3 36
18 82
06 04
8 90
t ri
78 95
4 25
004 745
5 67
282 61
0000 1
xb bc
M ode
63 63
Ġ94 0000
Ġ4 84
24 58
Ġ4 55
3 93
Ġ3 12
4 58
73 16
0 77
is wap
5 66
Ad visors
Ġa vailable
4 68
8 75
4 93
6 611
Ġ3 37
000000000000000000000000000000000000000000000000000000000000006 000000000000000000000000000000000000000000000000000000000000000
6 71
Con version
Ġ5 65
Ġ65 000000000
Time locked
3 06
set Minter
Ġset Minter
M et
72 68
RES S
Ġ38 000000000
Ġ2 90
AD D
e aa
re as
D ata
7571 336
1 71
ed b
RI BU
2 78
ir st
8 12
RIBU TION
Ġ4 73
Ġ25 7
0 93
1 33
5 28
6 23
Start Time
tri eve
1 23
9 76
V ol
d ow
ch ase
ve st
5 31
Ġin itialize
inc rease
cf d
252 00
Vol ume
1 63
Ġ5 11
2 96
CONT RIBUTION
ADD RESS
reas ur
3 98
Mint Agent
Ġ75 000000000
Ġ72 000000000
08 0000000000
ultis ig
Ġ2 001
5 03
9 09
a vailable
k le
Ġ6 23
uthorize Operator
6 05
8 21
st ake
end ing
Ġ5 94
Ġ5 85
change Owner
Ġchange Owner
kle Root
5 79
Ġre gister
Ġ53 000000000
Ġ3 46
Ġ4 02
comm it
Fill ed
block Account
Ġ5 24
Ġ3 00000000000
gra nu
la rity
granu larity
Ġ3 17
ĠbalanceOf At
C reate
balanceOf At
6 22
8 74
2 72
Ġ1 000000000000000
Ġ4 60
1 35
71 63
ĠtotalSupply At
Ġre gistry
Ġset Name
ToICAP WithReference
totalSupply At
5 63
d Owner
d ad
99 04
re gistry
test Trade
Ġc ollect
Ġ63 000000000
mount Filled
8 91
P ending
Ġ5 03
in itialize
Ġ3 27
re leased
Ġ4 13
Ġ6 08
6611 7276
47 0801
Ġ84 000000000
Ġ167 28261
Ġ773 6399
0791 470801
Ġ16728261 0791470801
G en
AL E
e i
Ġ3 97
Ġre leased
it ty
0000000 1
Ġ37 000000000
02 27
6 76
Grant s
Ġ5 55
4 24
6 77
D ra
000000000000000000000000000000000000000000000000000000000000000 6
4 78
Ġ5 54
4 16
7 66
Ġ ad
Ġ2 000000000000000000
1 22
5 76
set Name
5 35
7 68
5 93
8 11
Ġ3 19
T arget
c anUpgrade
Ġ3 43
Ġc anUpgrade
f it
Ġ46 000000000
Ġe x
2 92
ir th
Contribu ted
15 45
Trade able
is tra
A R
Ġ28 6
791 2
2 77
5 18
Ġ5 71
Ġ6 24
Tokens For
Ġ39 000000000
V es
Ves ted
col lect
00 16
000000000000000000000000 1
M ar
Ġ4 67
75 39
Account LevelsAddr
account LevelsAddr
4 36
1 92
5 25
ad ata
] )
] )':
Ġ4 92
21 87
Ġ18 0000
Ġ25 9
Pl an
8 145
B irth
R N
8 39
02 000
Ġ4 26
Ġ71 000000000
Plan et
Ġ5 64
74 68
reasur y
91 93
61 05
e xecute
BU RN
Ġ5 38
il y
3 11
5 16
Ġ1 0000000
21 004745
09 24
Ġ6 25
rketing Wallet
B id
Ġ4 42
Ġwithdraw Token
8 63
8 95
0000000000000000000000000000000000000000000000000000000000000000 000000000
N once
7 96
on ERC
38 99
Ġ61 000000000
P la
6 26
8 45
max Supply
Ġ2 000000000000000
Pro fit
Ġ3 29
Ġ11 98
61 03
ura tion
Ġ3 09
Ġ6 98
97 91
Ġ3 56
xy Type
Ġ56 000000000
Ġ3 67
Ġ3 92
Ġ6 22
Ġ4 41
Ġ28 2
7 63
bl ic
06 24
Ġ28 3
Ġ5 23
Ġ12 04
Token Exchange
date Main
Migration Phase
Date Main
quest TokenExchange
Ġ7 74
Ġ12 03
Con nector
Ġ58 000000000
5 13
Ġ3 00000000000000000
76 00
pending Admin
6 92
000 4
6 25
C allback
D U
Ġ4 89
withdraw Tokens
Ġwithdraw Tokens
Ġ6 74
o Address
Ġs plit
Ġ5 13
04 31
4 63
5 07
Ġ95 000
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
re gister
24 88
4 90
Ġ4 0000000000000000
iswap V
3 96
5 11
6 73
8 68
4 11
Ġ5 78
3 32
Ġ3 30
1 32
4 22
S afe
ca tion
Ġdeposit Token
0 72
2 76
Ġ4 51
batch Transfer
Ġ5 48
Ġ5 66
0000000000000000000000000000000000000000000000000000000000000000 2
5 06
8 64
Ġ11 73
Ġ6 21
RA TION
DU RATION
Ġ49 000000000
Ġ3 47
95 70
6 72
Ġ5 45
Account Is
Ġ5 86
18 08
withdraw Token
Ġ18 25
26 08
00000000000000000000000000000000 00
Ġ4 07
Pro pos
I ssue
21 000
33 33
97 94
7 000000000000000000000000
8 16
02 001
Ġ6 68
enable Transfers
Ġenable Transfers
0 66
o use
7 72
e nti
E x
Price s
98 00
79 05
Auth ori
3 02
4 02
8 000000000000000000000000
Met adata
A l
Ġ25 0000000000000000
Ġ11 63
Ġ5 74
er ly
erly ing
00000000000000000000000000000000000000000000000000000000000000 3
da y
Address es
Ġ66 66
Ġ6 75
Issue d
72 95
N ext
Ġ6 00
0000000000000000000000000000000000000000000000000000000000000000 0000000000
Ġ6 93
O pen
Ġ4 27
cca d
7 09
Ġ4 22
72 000
64 67
00000000000000000000000000000000000000000000000000000000 64
0 96
In vestor
freeze Account
Ġ6 99
Ġ12 28
Ġis Token
9999 99
is Token
78 20
Ġ15 0000000000000000
allow Transfers
7 90
Ġ7 65
Ġ4 43
96 95
Ġ13 28
Ġa tomicMatch
D is
N A
Auth enti
Authenti cation
ig ner
08 19
Ġ6 61
Ġ3 62
Ran do
Rando m
Ġ14 44
vali d
Ġ5 75
deposit Token
25 88
5 72
Ġ6 01
4 77
6 06
1 26
7 07
7 92
Ġ12 0000000000000000
65 000
72 00
Ġ11 0000000000
Ġ13 05
ca rd
8 09
Ġ13 08
1 251
4 31
5 32
8 66
Dra in
Ġ691 63
set Authority
Ġset Authority
Ġmax Supply
mergenc yERC
6374 342
Ġ3 66
Ġ25 0
65 73
Ġ64 000000000
Ġun iswapV
Ġ3 20
Ġ5 12
305 6
Ġ3 49
Ġ11 94
8 26
Ġ4 09
64 61
5 7600080
64 759
Ġ55 000
4 79
f fer
1 06
7 02
e st
Ġ88 000000000
Ġa uthority
a uthority
54 93
Ġ3 42
8 06
Q ui
Ġ7 38
UN IT
Qui ck
4 76
Ġ5 88
l i
Ġ5 68
66 000
3 92
Ġ5 43
Ġorder Fills
1 96
Ġ4 96
Ġ4 17
New Owner
Vested Tokens
3 76
Ġ3 10
Uns oldTokens
15 15
Ġ18 58
order Fills
25 000
NA ME
m ulti
Ġ nominate
28 54
78 87
I D
000000000 2
Ġ501 1882
7274 4793
Ġ6666 72744793
Ġ666672744793 7912
ig n
Ġ12 00
Ġa cti
for ward
Ġo pen
Ġ4 06
Ġ94 795
5 12
33 63
Ġ5 22
28 28
75 74
07 99
09 05
fee Account
Ġfee Account
21 68
Ġ8 15
rowd FundAddress
o pen
LOC K
2 97
B en
Ġ4 81
Ġ5 98
2 07
O ut
01 01
73 35
G EN
C ard
25 25
Ġ12 23
000000000000000000000000 000
Ġ3 57
xe be
Ben eficiary
8 20
a k
eeeeeeeeeeeeeeee eeeeeeeeeeeeeeee
24 08
Ġ15 75
Ġ3 69
visor Tokens
0000000000000000000000000000000000000000000000000000000000000002 000000000000000000000000
5 29
25 0000000000
ar ted
1 72
Ġ13 01
leaseA d
000000000000000000000000000000000000000000000000 0
Ġ99 9
0 25200
visors Allocation
S ymbol
Ġ13 25
73 61
54 48
visor Address
Presale Supply
4 97
E njinTeam
in centivisation
11 63
To Allocation
Ġ13 68
Ġe njinTeam
en jinTeam
total AllocatedTo
Ġtotal AllocatedTo
ser ve
EN J
Ġin centivisation
ĠswapExact TokensFor
Crowdsale Allocation
trieve UnsoldTokens
leaseAd visorTokens
EnjinTeam Tokens
M e
8 36
l f
91 23
63 65
81 04
75 0000000000
cover ed
8 30
ily Limit
Ġ5 95
0000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000001
5 92
Operator For
51 29
Ġ6 03
C h
61 45
eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee eeeeeeee
W ei
28 01
Ġ25 0000000000
Ġ grant
6 29
65 68
4 27
25 08
Ġ13 65
Ġ62 000000000
Ġ4 72
Ġ5 16
28 0000000000
Ġ15 99
Ġ7 05
Ġ73 000000000
fault Operators
Pla yer
P ool
1 31
34 08
66 63
61 65
Ġ99 244
B onus
Ġ4 57
Ġ13 23
Ġrelease TokenTransfer
6 20
Ġ8 18
To talSupply
release TokenTransfer
Siring Auction
71 000
Ġ7 64
1 79
Ġ7 99
04 48
02 08
4 33
Ġ17 99
Ġ115 33
Swap Callback
S Y
68 75
xf ca
000000000000000000000000000000000000000000000000000000000000008 000000000000000000000000000000000000000000000000000000000000000
s De
73 48
Al er
m igration
Ġ5 02
Ġ pendingOwner
92 000
905 3
Ġm igration
Ġ57 000000000
64 56
Ġ6 65
Ġ10 78
700 6
in ation
Ġ2 00000000
st ination
87 6347
4 000000000000000000000000
91 03
000000000000000000000000000000000000000000000000000000000000 02
Ġ6 94
Ġ43 000000000
5 96
ns ity
Ġget Dis
Planet sDe
covered PlanetsDe
ĠgetDis coveredPlanetsDe
ĠgetDiscoveredPlanetsDe nsity
6 09
o ts
64 50
ur chase
Ġ15 14
Ġre leaseAgent
8 37
re leaseAgent
set ReleaseAgent
Ġset ReleaseAgent
M ultisig
Ġ13 74
irst Day
transfer Agents
Ġtransfer Agents
set TransferAgent
Ġ12 71
Ġset TransferAgent
8 79
64 01
0 76
77 38
DA O
Ġ15 93
Ġ174 54
call back
Ġ contract
B OL
M BOL
75 34
SY MBOL
an t
Ġ5 33
Ġset Admin
64 0000000000
set Admin
72 24
75 000
change Controller
Ġchange Controller
B reed
funding StartBlock
500 1489
Ġfunding StartBlock
68 78
lo se
80 95
7305 85
1 29
O S
98 000
Distribu tion
3 66
b aseURI
03 05
Ġ10 68
Re quire
Ġb aseURI
828 03
Ġ5 93
78 68
Ġ7 93
und erlying
1 644
16 000
8 29
Ġ3 60
po se
00 18
01 000
03 000000000
Ġ5 51
61 64
3 97
28 000
20 24
8 67
01 96
Ġ5 73
claim Ether
er t
78 000
Black list
c urrent
21 71
de ac
Ġ3 000000000000000
58 55
Ġ5 83
Ġ15 95
xb dd
che ck
G ame
Ġ13 95
Ġ103 730585
Ġ153 7778
973 0346
Ġ103730585 9730346
Ġ1037305859730346 655
Ġget Random
Propos al
vi de
68 71
Ġ17 98
Ġ333 333
5 27
00000000000000000000000000000000 00000000
68 0000000000
18 88
4 26
38 000
76 0000000000
3848 38
Ġ7 75
00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 0000000000000000000000000000000000000000000000000000000000000000
CO R
Ġ5 62
61 247
07 93
Ġ7 95
Ġ105 000000000
24 20
98 75
8 70
Ġ4 82
Ġ5 53
38 64
04 000
Ġ18 384838
684 656
167 684656
funding EndBlock
Ġfunding EndBlock
Ġ17454 167684656
Ġ17454167684656 0136
Ġ3 39
Ġ14 48
73 000
Ġ10 65
f rozenAccount
Ġ28 7
00 36
4 06
74 010
23 94
Ġ17 28
Ġc urrent
Ġ108 000000000
1 27
Ġ8 24
08 94
635 92
01 91
72 28
Authori zed
63 000
Ġ6 28
xa dd
Ġ8 44
92 0000000000
Ġf rozenAccount
Ġ69 000000000
00 14
63 75
Ġ6 38
Ġfreeze Account
sh ot
65 65
96 05
07 000
Ġ5 31
68 83
Ġ14 64
09 000
xdc df
Ġ5 07
64 23
claim Ownership
Ġclaim Ownership
2 90
Ġ7 04
Ġset Fee
4 66
4 549
Ġ6 78
Ġ22 00000000
Ġ75 000
Ġw hitelist
73 00
96 94
St arted
vide nd
0000000000000000 00000000000000
73 64
set Fee
ss et
Ġ6 71
govern or
5 90
Ġ15 18
07 71
locked Tokens
n um
Ġ4 56
yPa th
04 08
Ġ2001 000000
5 22
97 38
Ġ4 83
Ġ5 17
Ġ12 94
Ġ6 64
mergenc y
Ġ7 01
Ġ testCopy
78 0000000000
76 04
77 94
55 205
Ġ7 21
Ġ121 000
8 27
Ġ5 06
r t
1 66
S w
Ġ8 35
73 95
07 00
Ġ49 73
Ġ14 24
ef ore
21 18
5 09
U ser
pe nt
000000000 4
Ġ11 99
03 47
11 11
838 119
72 21
Ġ16 68
main ing
h al
34 95
76 64
31 18
5 36
xd fe
Ġ59 000000000
Ġ76 000000000
28 23
78 08
02 0000000000
72 0000000000
77 24
Ġ7 25
71 58
00 45
75 65
Ġ17 91
21 05
Ġ25 000
Bu yPath
w hitelist
24 95
tokenCreation Min
ĠtokenCreation Min
v Wallet
Ġ18 55
07 74
Ġ co
98 61
xb fa
15 61
59 09
68 000
38 19
63 34
To day
Ġ18 65
38 08
set TokenInformation
Ġset TokenInformation
tokenCreation Cap
ĠtokenCreation Cap
Ġ16 91
73 65
Ġ14 05
End Time
00000000000000000000000000000000 0000000000
23 08
23 78
76 03
Ġ558 0000000000000
x fff
ee per
93 000
25 00
1 681
c reationBlock
75 75
Ġc reationBlock
B efore
Ġ12 01
505 0505
Ġ7 76
A vailable
Ġ tra
Ġ blacklist
Ġ14 51
0000000000000000 000000000000
99 46
75 143
74 43
25 75
ea r
pent Today
Ġ3 40
Ġ4 97
61 54
94 28
0000000000000000 0000
Ġ8 14
Ġ generateTokens
Ġ4 53
06 01
11 08
Ġ28 9
transfer AnyERC
75 27
21 03
38 05
Ġtransfer AnyERC
Ġ94 000000
RE A
77 000
1 20
8 07
94 18
Ġ8 08
Ġ14 68
Ġ13 35
Ġdestroy Tokens
destroy Tokens
ss ert
Ġ13 0000000000
021 29
Ġ1 726
73 68
34 38
ccb d
Ġ4 46
63 54
66 99
1 07
02 03
96 0000000000
73 0000000000
Ran k
92 21
R O
73 24
72 64
00 34
all oca
78 03
Ġ15 03
Ġ13 04
Ġ81 000000000
28 08
74 65
12 73
00 15
Ġ47 000000000
3 09
8 62
Ġ4 47
Ġ4 19
Ġ7 24
93 71
Ġ14 74
97 000
Contract Address
3 79
3 000000000000000000000000
72 38
77 68
Ġ74 000000000
00000000000000000000000000000000 0000
75 73
04 45
71 52
64 98
Ġ4 29
Ġ12 91
Se ll
74 0000000000
03 01
76 63
Ġ17 05
98 54
96 65
Com m
Ġ5 57
0000000 2
Claim ed
Ġ11 75
Ġ13 38
Ġ105 26
25 94
74 75
Ġ11 91
749 73
Z ER
Require ment
ZER OS
64 35
Ġ14 88
Ġ45 000
Ġ132 000000000
Ġ3 59
Ġ38 5
76 05
76 93
77 73
07 08
Ġ9 75
Set ter
Comm unity
61 13
21 27
Ġ11 18
742 61
61 951
Ġ8 0000000000000000
72 75
76 75
Ġ12 78
34 764
944 000
s plit
rom o
Ġ13 03
Ġ90000 000
Ġ22 000
igra ted
28 43
21 88
Ġ28 0
Ġp rice
01 38
78 05
66 65
Ġ67 000000000
25 24
Ġ5 84
98 53
23 48
Ġ15 05
Sale Auction
Ġ450 38
21 00
23 61
Ġ governance
Ġ4 30
Ġ4 59
63 35
09 71
itiali zed
Stop Receive
00000000000000000000000000000000000000000000000000000000000000 22
61 44
Ġ6 0000000000000000
Ġ104 000000000
8 96
78 55
90 24
06 68
76 01
22 28
er ator
23 28
000000000000000000000000000000000000000000000000000000000000000 5
xdc dc
i f
97 04
Withdraw al
N COR
U se
Ġ3 50
23 58
Ġ77 000000000
BA NCOR
94 2461
93 38
Ġ6 63
79 03
099 843
6 97
6 90
72 61
98 0000000000
23 93
Ġ8 25
Ġ97 000000000
06 08
4 32
Ġ4 36
01 03
Ġ5 37
token Factory
Ġtoken Factory
parent Token
Ġparent Token
V E
21 94
Ġis Finalized
is Finalized
04 0000000000
increase Nonce
3 07
In activityReleasePeriod
Ġ9 01
Ġ7 03
000000000000000000000000 7
validate Orders
Active Transaction
valid Order
validateOrders Before
24 0000000000
4 07
L o
73 03
8 140
parent SnapShotBlock
Ġparent SnapShotBlock
d Count
25 78
38 0000000000
23 000
Ġ91 000000000
Ġ4 10
99 0000000000
Ġ8 05
000000000000000000000000 6
72 65
90 61
96 00
77 00
Ġcreate CloneToken
create CloneToken
63 93
07 05
Co in
Ġ4 37
97 65
96 64
71 0000000000
fcc ce
Ġ5 52
98 63
Ġ7 08
Mar keting
74 000
96 25
07 68
91 45
77 64
09 0000000000
Ġ7 71
2 00000000
ak ing
21 91
92 08
Ġun freeze
un freeze
73 18
98 15
Ġ11 65
838 250
Create dCount
xbdd ccd
74261 145
68 55
Ġ5 19
68 88
Ġ8 01
66 04
Ġ16 94
23 34
72 036
68 65
Sale Contract
01 0000000000
08 08
4 29
00 41
Ġ11 95
28 18
75 18
74 35
09 00
Ġ85 000000000
Ġ5 46
38 18
Ġ8 03
Ġ15 01
15 65
Ġ10 24
1 77
64 34
61 25
63 45
256 5
Ġ8 88
fe ddc
Ġmint ers
96 74
Ġ96 000000000
78 35
02 05
66 0000000000
D ATE
28 58
Ġ15 16
06 25
76 08
95 0000000000
02 99
mint ers
Ġ78 000000000
91 54
TOKEN S
64 000
23 04
72 25
92 04
Ġ14 34
Ġ233 00
